arduino/ArduinoCore-samd/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.cpu=Microcontroller
menu.clock=Clock Source
menu.usb=USB Config
menu.serial=Serial Config
menu.bootloader=Bootloader Size
menu.timer=Timer PWM Frequency
menu.float=Floating Point
menu.config=Build Options


# MattairTech Xeno Mini
mattairtech_xeno_mini.name=MattairTech Xeno Mini
mattairtech_xeno_mini.vid.0=0x16D0
mattairtech_xeno_mini.pid.0=0x0557
mattairtech_xeno_mini.vid.1=0x16D0
mattairtech_xeno_mini.pid.1=0x0856
mattairtech_xeno_mini.vid.2=0x16D0
mattairtech_xeno_mini.pid.2=0x0B41
mattairtech_xeno_mini.vid.3=0x16D0
mattairtech_xeno_mini.pid.3=0x0B40
mattairtech_xeno_mini.vid.4=0x16D0
mattairtech_xeno_mini.pid.4=0x0A0C
mattairtech_xeno_mini.vid.5=0x16D0
mattairtech_xeno_mini.pid.5=0x0856
mattairtech_xeno_mini.build.usb_manufacturer="MattairTech LLC"
mattairtech_xeno_mini.build.board=SAMD_ZERO
mattairtech_xeno_mini.build.core=arduino
mattairtech_xeno_mini.build.variant=Xeno_Mini
mattairtech_xeno_mini.build.variant_system_lib=
mattairtech_xeno_mini.build.vid=0x16D0
mattairtech_xeno_mini.upload.protocol=sam-ba
mattairtech_xeno_mini.bootloader.tool=arduino:openocd
mattairtech_xeno_mini.menu.float.default=Print & String use auto-promoted doubles only
mattairtech_xeno_mini.menu.float.default.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
mattairtech_xeno_mini.menu.float.print=Print uses separate singles and doubles
mattairtech_xeno_mini.menu.float.print.build.floatconfig=FLOAT_PRINT_SINGLES_DOUBLES
mattairtech_xeno_mini.menu.float.string=String uses separate singles and doubles
mattairtech_xeno_mini.menu.float.string.build.floatconfig=FLOAT_STRING_SINGLES_DOUBLES
mattairtech_xeno_mini.menu.float.both=Print & String use separate singles and doubles
mattairtech_xeno_mini.menu.float.both.build.floatconfig=FLOAT_BOTH_SINGLES_DOUBLES
mattairtech_xeno_mini.menu.config.disabled=config.h disabled
mattairtech_xeno_mini.menu.config.disabled.build.buildconfig=CONFIG_H_DISABLED
mattairtech_xeno_mini.menu.config.enabled=config.h enabled (mostly code size reductions)
mattairtech_xeno_mini.menu.config.enabled.build.buildconfig=CONFIG_H_ENABLED
mattairtech_xeno_mini.menu.clock.crystal_32k=32KHZ_CRYSTAL
mattairtech_xeno_mini.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
mattairtech_xeno_mini.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
mattairtech_xeno_mini.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
mattairtech_xeno_mini.menu.clock.internal=INTERNAL_OSCILLATOR
mattairtech_xeno_mini.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
mattairtech_xeno_mini.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
mattairtech_xeno_mini.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
mattairtech_xeno_mini.menu.timer.timer_732Hz=732.4Hz (16-bit)
mattairtech_xeno_mini.menu.timer.timer_732Hz.build.timerconfig=TIMER_732Hz
mattairtech_xeno_mini.menu.timer.timer_366Hz=366.2Hz (16-bit)
mattairtech_xeno_mini.menu.timer.timer_366Hz.build.timerconfig=TIMER_366Hz
mattairtech_xeno_mini.menu.timer.timer_244Hz=244.1Hz (16-bit)
mattairtech_xeno_mini.menu.timer.timer_244Hz.build.timerconfig=TIMER_244Hz
mattairtech_xeno_mini.menu.timer.timer_183Hz=183.1Hz (16-bit)
mattairtech_xeno_mini.menu.timer.timer_183Hz.build.timerconfig=TIMER_183Hz
mattairtech_xeno_mini.menu.timer.timer_146Hz=146.5Hz (16-bit)
mattairtech_xeno_mini.menu.timer.timer_146Hz.build.timerconfig=TIMER_146Hz
mattairtech_xeno_mini.menu.timer.timer_122Hz=122.1Hz (16-bit)
mattairtech_xeno_mini.menu.timer.timer_122Hz.build.timerconfig=TIMER_122Hz
mattairtech_xeno_mini.menu.timer.timer_105Hz=104.6Hz (16-bit)
mattairtech_xeno_mini.menu.timer.timer_105Hz.build.timerconfig=TIMER_105Hz
mattairtech_xeno_mini.menu.timer.timer_81Hz=81.38Hz (16-bit)
mattairtech_xeno_mini.menu.timer.timer_81Hz.build.timerconfig=TIMER_81Hz
mattairtech_xeno_mini.menu.timer.timer_61Hz=61.04Hz (16-bit)
mattairtech_xeno_mini.menu.timer.timer_61Hz.build.timerconfig=TIMER_61Hz
mattairtech_xeno_mini.menu.timer.timer_31Hz=30.52Hz (16-bit)
mattairtech_xeno_mini.menu.timer.timer_31Hz.build.timerconfig=TIMER_31Hz
mattairtech_xeno_mini.menu.timer.timer_187500Hz=187500Hz (8-bit)
mattairtech_xeno_mini.menu.timer.timer_187500Hz.build.timerconfig=TIMER_187500Hz
mattairtech_xeno_mini.menu.timer.timer_93750Hz=93750Hz (8-bit)
mattairtech_xeno_mini.menu.timer.timer_93750Hz.build.timerconfig=TIMER_93750Hz
mattairtech_xeno_mini.menu.timer.timer_62500Hz=62500Hz (8-bit)
mattairtech_xeno_mini.menu.timer.timer_62500Hz.build.timerconfig=TIMER_62500Hz
mattairtech_xeno_mini.menu.timer.timer_37500Hz=37500Hz (8-bit)
mattairtech_xeno_mini.menu.timer.timer_37500Hz.build.timerconfig=TIMER_37500Hz
mattairtech_xeno_mini.menu.timer.timer_20833Hz=20833Hz (8-bit)
mattairtech_xeno_mini.menu.timer.timer_20833Hz.build.timerconfig=TIMER_20833Hz
mattairtech_xeno_mini.menu.timer.timer_12500Hz=12500Hz (8-bit)
mattairtech_xeno_mini.menu.timer.timer_12500Hz.build.timerconfig=TIMER_12500Hz
mattairtech_xeno_mini.menu.timer.timer_7500Hz=7500Hz (8-bit)
mattairtech_xeno_mini.menu.timer.timer_7500Hz.build.timerconfig=TIMER_7500Hz
mattairtech_xeno_mini.menu.timer.timer_4166Hz=4166Hz (8-bit)
mattairtech_xeno_mini.menu.timer.timer_4166Hz.build.timerconfig=TIMER_4166Hz
mattairtech_xeno_mini.menu.timer.timer_2930Hz=2930Hz (8-bit)
mattairtech_xeno_mini.menu.timer.timer_2930Hz.build.timerconfig=TIMER_2930Hz
mattairtech_xeno_mini.menu.timer.timer_1465Hz=1465Hz (8-bit, 16-bit for D51)
mattairtech_xeno_mini.menu.timer.timer_1465Hz.build.timerconfig=TIMER_1465Hz
mattairtech_xeno_mini.menu.cpu.samd21g18a=SAMD21G18A
mattairtech_xeno_mini.menu.cpu.samd21g18a.upload.maximum_size=253952
mattairtech_xeno_mini.menu.cpu.samd21g18a.build.mcu=cortex-m0plus
mattairtech_xeno_mini.menu.cpu.samd21g18a.build.mathlib=arm_cortexM0l_math
mattairtech_xeno_mini.menu.cpu.samd21g18a.build.f_cpu=48000000L
mattairtech_xeno_mini.menu.cpu.samd21g18a.build.usb_product="Xeno Mini D21"
mattairtech_xeno_mini.menu.cpu.samd21g18a.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags} -DARM_MATH_CM0PLUS
mattairtech_xeno_mini.menu.cpu.samd21g18a.build.ldscript=flash_256KB.ld
mattairtech_xeno_mini.menu.cpu.samd21g18a.build.openocdscript=openocd_scripts/SAMD21G18A.cfg
mattairtech_xeno_mini.menu.cpu.samd21g18a.bootloader.file=zero/binaries/sam_ba_Xeno_Mini_SAMD21G18A.bin
mattairtech_xeno_mini.menu.cpu.samd21g17a=SAMD21G17A
mattairtech_xeno_mini.menu.cpu.samd21g17a.upload.maximum_size=122880
mattairtech_xeno_mini.menu.cpu.samd21g17a.build.mcu=cortex-m0plus
mattairtech_xeno_mini.menu.cpu.samd21g17a.build.mathlib=arm_cortexM0l_math
mattairtech_xeno_mini.menu.cpu.samd21g17a.build.f_cpu=48000000L
mattairtech_xeno_mini.menu.cpu.samd21g17a.build.usb_product="Xeno Mini D21"
mattairtech_xeno_mini.menu.cpu.samd21g17a.build.extra_flags=-D__SAMD21G17A__ {build.usb_flags} -DARM_MATH_CM0PLUS
mattairtech_xeno_mini.menu.cpu.samd21g17a.build.ldscript=flash_128KB.ld
mattairtech_xeno_mini.menu.cpu.samd21g17a.build.openocdscript=openocd_scripts/SAMD21G17A.cfg
mattairtech_xeno_mini.menu.cpu.samd21g17a.bootloader.file=zero/binaries/sam_ba_Xeno_Mini_SAMD21G17A.bin
mattairtech_xeno_mini.menu.cpu.samd21g16a=SAMD21G16A
mattairtech_xeno_mini.menu.cpu.samd21g16a.upload.maximum_size=57344
mattairtech_xeno_mini.menu.cpu.samd21g16a.build.mcu=cortex-m0plus
mattairtech_xeno_mini.menu.cpu.samd21g16a.build.mathlib=arm_cortexM0l_math
mattairtech_xeno_mini.menu.cpu.samd21g16a.build.f_cpu=48000000L
mattairtech_xeno_mini.menu.cpu.samd21g16a.build.usb_product="Xeno Mini D21"
mattairtech_xeno_mini.menu.cpu.samd21g16a.build.extra_flags=-D__SAMD21G16A__ {build.usb_flags} -DARM_MATH_CM0PLUS
mattairtech_xeno_mini.menu.cpu.samd21g16a.build.ldscript=flash_64KB.ld
mattairtech_xeno_mini.menu.cpu.samd21g16a.build.openocdscript=openocd_scripts/SAMD21G16A.cfg
mattairtech_xeno_mini.menu.cpu.samd21g16a.bootloader.file=zero/binaries/sam_ba_Xeno_Mini_SAMD21G16A.bin
mattairtech_xeno_mini.menu.cpu.samd21g15a=SAMD21G15A
mattairtech_xeno_mini.menu.cpu.samd21g15a.upload.maximum_size=24576
mattairtech_xeno_mini.menu.cpu.samd21g15a.build.mcu=cortex-m0plus
mattairtech_xeno_mini.menu.cpu.samd21g15a.build.mathlib=arm_cortexM0l_math
mattairtech_xeno_mini.menu.cpu.samd21g15a.build.f_cpu=48000000L
mattairtech_xeno_mini.menu.cpu.samd21g15a.build.usb_product="Xeno Mini D21"
mattairtech_xeno_mini.menu.cpu.samd21g15a.build.extra_flags=-D__SAMD21G15A__ {build.usb_flags} -DARM_MATH_CM0PLUS
mattairtech_xeno_mini.menu.cpu.samd21g15a.build.ldscript=flash_32KB.ld
mattairtech_xeno_mini.menu.cpu.samd21g15a.build.openocdscript=openocd_scripts/SAMD21G15A.cfg
mattairtech_xeno_mini.menu.cpu.samd21g15a.bootloader.file=zero/binaries/sam_ba_Xeno_Mini_SAMD21G15A.bin
mattairtech_xeno_mini.menu.cpu.samd51g19a_120=SAMD51G19A_120MHz
mattairtech_xeno_mini.menu.cpu.samd51g19a_120.upload.maximum_size=516096
mattairtech_xeno_mini.menu.cpu.samd51g19a_120.build.mcu=cortex-m4
mattairtech_xeno_mini.menu.cpu.samd51g19a_120.build.mathlib=arm_cortexM4lf_math
mattairtech_xeno_mini.menu.cpu.samd51g19a_120.build.f_cpu=120000000L
mattairtech_xeno_mini.menu.cpu.samd51g19a_120.build.usb_product="Xeno Mini D51"
mattairtech_xeno_mini.menu.cpu.samd51g19a_120.build.extra_flags=-D__SAMD51G19A__ {build.usb_flags} -mfloat-abi=softfp -mfpu=fpv4-sp-d16 -DARM_MATH_CM4
mattairtech_xeno_mini.menu.cpu.samd51g19a_120.build.ldscript=flash_m4f_512KB.ld
mattairtech_xeno_mini.menu.cpu.samd51g19a_120.build.openocdscript=openocd_scripts/SAMD51G19A.cfg
mattairtech_xeno_mini.menu.cpu.samd51g19a_120.bootloader.file=zero/binaries/sam_ba_Xeno_Mini_SAMD51G19A.bin
mattairtech_xeno_mini.menu.cpu.samd51g19a_48=SAMD51G19A_48MHz
mattairtech_xeno_mini.menu.cpu.samd51g19a_48.upload.maximum_size=516096
mattairtech_xeno_mini.menu.cpu.samd51g19a_48.build.mcu=cortex-m4
mattairtech_xeno_mini.menu.cpu.samd51g19a_48.build.mathlib=arm_cortexM4lf_math
mattairtech_xeno_mini.menu.cpu.samd51g19a_48.build.f_cpu=48000000L
mattairtech_xeno_mini.menu.cpu.samd51g19a_48.build.usb_product="Xeno Mini D51"
mattairtech_xeno_mini.menu.cpu.samd51g19a_48.build.extra_flags=-D__SAMD51G19A__ {build.usb_flags} -mfloat-abi=softfp -mfpu=fpv4-sp-d16 -DARM_MATH_CM4
mattairtech_xeno_mini.menu.cpu.samd51g19a_48.build.ldscript=flash_m4f_512KB.ld
mattairtech_xeno_mini.menu.cpu.samd51g19a_48.build.openocdscript=openocd_scripts/SAMD51G19A.cfg
mattairtech_xeno_mini.menu.cpu.samd51g19a_48.bootloader.file=zero/binaries/sam_ba_Xeno_Mini_SAMD51G19A.bin
mattairtech_xeno_mini.menu.cpu.samd51g18a_120=SAMD51G18A_120MHz
mattairtech_xeno_mini.menu.cpu.samd51g18a_120.upload.maximum_size=253952
mattairtech_xeno_mini.menu.cpu.samd51g18a_120.build.mcu=cortex-m4
mattairtech_xeno_mini.menu.cpu.samd51g18a_120.build.mathlib=arm_cortexM4lf_math
mattairtech_xeno_mini.menu.cpu.samd51g18a_120.build.f_cpu=120000000L
mattairtech_xeno_mini.menu.cpu.samd51g18a_120.build.usb_product="Xeno Mini D51"
mattairtech_xeno_mini.menu.cpu.samd51g18a_120.build.extra_flags=-D__SAMD51G18A__ {build.usb_flags} -mfloat-abi=softfp -mfpu=fpv4-sp-d16 -DARM_MATH_CM4
mattairtech_xeno_mini.menu.cpu.samd51g18a_120.build.ldscript=flash_m4f_256KB.ld
mattairtech_xeno_mini.menu.cpu.samd51g18a_120.build.openocdscript=openocd_scripts/SAMD51G18A.cfg
mattairtech_xeno_mini.menu.cpu.samd51g18a_120.bootloader.file=zero/binaries/sam_ba_Xeno_Mini_SAMD51G18A.bin
mattairtech_xeno_mini.menu.cpu.samd51g18a_48=SAMD51G18A_48MHz
mattairtech_xeno_mini.menu.cpu.samd51g18a_48.upload.maximum_size=253952
mattairtech_xeno_mini.menu.cpu.samd51g18a_48.build.mcu=cortex-m4
mattairtech_xeno_mini.menu.cpu.samd51g18a_48.build.mathlib=arm_cortexM4lf_math
mattairtech_xeno_mini.menu.cpu.samd51g18a_48.build.f_cpu=48000000L
mattairtech_xeno_mini.menu.cpu.samd51g18a_48.build.usb_product="Xeno Mini D51"
mattairtech_xeno_mini.menu.cpu.samd51g18a_48.build.extra_flags=-D__SAMD51G18A__ {build.usb_flags} -mfloat-abi=softfp -mfpu=fpv4-sp-d16 -DARM_MATH_CM4
mattairtech_xeno_mini.menu.cpu.samd51g18a_48.build.ldscript=flash_m4f_256KB.ld
mattairtech_xeno_mini.menu.cpu.samd51g18a_48.build.openocdscript=openocd_scripts/SAMD51G18A.cfg
mattairtech_xeno_mini.menu.cpu.samd51g18a_48.bootloader.file=zero/binaries/sam_ba_Xeno_Mini_SAMD51G18A.bin
mattairtech_xeno_mini.menu.cpu.saml21g18b=SAML21G18B
mattairtech_xeno_mini.menu.cpu.saml21g18b.upload.maximum_size=253952
mattairtech_xeno_mini.menu.cpu.saml21g18b.build.mcu=cortex-m0plus
mattairtech_xeno_mini.menu.cpu.saml21g18b.build.mathlib=arm_cortexM0l_math
mattairtech_xeno_mini.menu.cpu.saml21g18b.build.f_cpu=48000000L
mattairtech_xeno_mini.menu.cpu.saml21g18b.build.usb_product="Xeno Mini L21"
mattairtech_xeno_mini.menu.cpu.saml21g18b.build.extra_flags=-D__SAML21G18B__ {build.usb_flags} -DARM_MATH_CM0PLUS
mattairtech_xeno_mini.menu.cpu.saml21g18b.build.ldscript=flash_256KB.ld
mattairtech_xeno_mini.menu.cpu.saml21g18b.build.openocdscript=openocd_scripts/SAML21G18B.cfg
mattairtech_xeno_mini.menu.cpu.saml21g18b.bootloader.file=zero/binaries/sam_ba_Xeno_Mini_SAML21G18B.bin
mattairtech_xeno_mini.menu.cpu.saml21g17b=SAML21G17B
mattairtech_xeno_mini.menu.cpu.saml21g17b.upload.maximum_size=122880
mattairtech_xeno_mini.menu.cpu.saml21g17b.build.mcu=cortex-m0plus
mattairtech_xeno_mini.menu.cpu.saml21g17b.build.mathlib=arm_cortexM0l_math
mattairtech_xeno_mini.menu.cpu.saml21g17b.build.f_cpu=48000000L
mattairtech_xeno_mini.menu.cpu.saml21g17b.build.usb_product="Xeno Mini L21"
mattairtech_xeno_mini.menu.cpu.saml21g17b.build.extra_flags=-D__SAML21G17B__ {build.usb_flags} -DARM_MATH_CM0PLUS
mattairtech_xeno_mini.menu.cpu.saml21g17b.build.ldscript=flash_128KB.ld
mattairtech_xeno_mini.menu.cpu.saml21g17b.build.openocdscript=openocd_scripts/SAML21G17B.cfg
mattairtech_xeno_mini.menu.cpu.saml21g17b.bootloader.file=zero/binaries/sam_ba_Xeno_Mini_SAML21G17B.bin
mattairtech_xeno_mini.menu.cpu.saml21g16b=SAML21G16B
mattairtech_xeno_mini.menu.cpu.saml21g16b.upload.maximum_size=57344
mattairtech_xeno_mini.menu.cpu.saml21g16b.build.mcu=cortex-m0plus
mattairtech_xeno_mini.menu.cpu.saml21g16b.build.mathlib=arm_cortexM0l_math
mattairtech_xeno_mini.menu.cpu.saml21g16b.build.f_cpu=48000000L
mattairtech_xeno_mini.menu.cpu.saml21g16b.build.usb_product="Xeno Mini L21"
mattairtech_xeno_mini.menu.cpu.saml21g16b.build.extra_flags=-D__SAML21G16B__ {build.usb_flags} -DARM_MATH_CM0PLUS
mattairtech_xeno_mini.menu.cpu.saml21g16b.build.ldscript=flash_64KB.ld
mattairtech_xeno_mini.menu.cpu.saml21g16b.build.openocdscript=openocd_scripts/SAML21G16B.cfg
mattairtech_xeno_mini.menu.cpu.saml21g16b.bootloader.file=zero/binaries/sam_ba_Xeno_Mini_SAML21G16B.bin
mattairtech_xeno_mini.menu.cpu.saml21g15b=SAML21G15B
mattairtech_xeno_mini.menu.cpu.saml21g15b.upload.maximum_size=24576
mattairtech_xeno_mini.menu.cpu.saml21g15b.build.mcu=cortex-m0plus
mattairtech_xeno_mini.menu.cpu.saml21g15b.build.mathlib=arm_cortexM0l_math
mattairtech_xeno_mini.menu.cpu.saml21g15b.build.f_cpu=48000000L
mattairtech_xeno_mini.menu.cpu.saml21g15b.build.usb_product="Xeno Mini L21"
mattairtech_xeno_mini.menu.cpu.saml21g15b.build.extra_flags=-D__SAML21G15B__ {build.usb_flags} -DARM_MATH_CM0PLUS
mattairtech_xeno_mini.menu.cpu.saml21g15b.build.ldscript=flash_32KB.ld
mattairtech_xeno_mini.menu.cpu.saml21g15b.build.openocdscript=openocd_scripts/SAML21G15B.cfg
mattairtech_xeno_mini.menu.cpu.saml21g15b.bootloader.file=zero/binaries/sam_ba_Xeno_Mini_SAML21G15B.bin
mattairtech_xeno_mini.menu.cpu.samc21g18a=SAMC21G18A
mattairtech_xeno_mini.menu.cpu.samc21g18a.upload.maximum_size=253952
mattairtech_xeno_mini.menu.cpu.samc21g18a.build.mcu=cortex-m0plus
mattairtech_xeno_mini.menu.cpu.samc21g18a.build.mathlib=arm_cortexM0l_math
mattairtech_xeno_mini.menu.cpu.samc21g18a.build.f_cpu=48000000L
mattairtech_xeno_mini.menu.cpu.samc21g18a.build.usb_product="Xeno Mini C21"
mattairtech_xeno_mini.menu.cpu.samc21g18a.build.extra_flags=-D__SAMC21G18A__ -DARM_MATH_CM0PLUS
mattairtech_xeno_mini.menu.cpu.samc21g18a.build.ldscript=flash_256KB.ld
mattairtech_xeno_mini.menu.cpu.samc21g18a.build.openocdscript=openocd_scripts/SAMC21G18A.cfg
mattairtech_xeno_mini.menu.cpu.samc21g18a.bootloader.file=zero/binaries/sam_ba_Xeno_Mini_SAMC21G18A.bin
mattairtech_xeno_mini.menu.cpu.samc21g17a=SAMC21G17A
mattairtech_xeno_mini.menu.cpu.samc21g17a.upload.maximum_size=122880
mattairtech_xeno_mini.menu.cpu.samc21g17a.build.mcu=cortex-m0plus
mattairtech_xeno_mini.menu.cpu.samc21g17a.build.mathlib=arm_cortexM0l_math
mattairtech_xeno_mini.menu.cpu.samc21g17a.build.f_cpu=48000000L
mattairtech_xeno_mini.menu.cpu.samc21g17a.build.usb_product="Xeno Mini C21"
mattairtech_xeno_mini.menu.cpu.samc21g17a.build.extra_flags=-D__SAMC21G17A__ -DARM_MATH_CM0PLUS
mattairtech_xeno_mini.menu.cpu.samc21g17a.build.ldscript=flash_128KB.ld
mattairtech_xeno_mini.menu.cpu.samc21g17a.build.openocdscript=openocd_scripts/SAMC21G17A.cfg
mattairtech_xeno_mini.menu.cpu.samc21g17a.bootloader.file=zero/binaries/sam_ba_Xeno_Mini_SAMC21G17A.bin
mattairtech_xeno_mini.menu.cpu.samc21g16a=SAMC21G16A
mattairtech_xeno_mini.menu.cpu.samc21g16a.upload.maximum_size=57344
mattairtech_xeno_mini.menu.cpu.samc21g16a.build.mcu=cortex-m0plus
mattairtech_xeno_mini.menu.cpu.samc21g16a.build.mathlib=arm_cortexM0l_math
mattairtech_xeno_mini.menu.cpu.samc21g16a.build.f_cpu=48000000L
mattairtech_xeno_mini.menu.cpu.samc21g16a.build.usb_product="Xeno Mini C21"
