arduino/ArduinoCore-samd/boards.txt
mattairtech_xeno_mini.menu.cpu.samc21g16a.build.extra_flags=-D__SAMC21G16A__ -DARM_MATH_CM0PLUS
mattairtech_xeno_mini.menu.cpu.samc21g16a.build.ldscript=flash_64KB.ld
mattairtech_xeno_mini.menu.cpu.samc21g16a.build.openocdscript=openocd_scripts/SAMC21G16A.cfg
mattairtech_xeno_mini.menu.cpu.samc21g16a.bootloader.file=zero/binaries/sam_ba_Xeno_Mini_SAMC21G16A.bin
mattairtech_xeno_mini.menu.cpu.samc21g15a=SAMC21G15A
mattairtech_xeno_mini.menu.cpu.samc21g15a.upload.maximum_size=24576
mattairtech_xeno_mini.menu.cpu.samc21g15a.build.mcu=cortex-m0plus
mattairtech_xeno_mini.menu.cpu.samc21g15a.build.mathlib=arm_cortexM0l_math
mattairtech_xeno_mini.menu.cpu.samc21g15a.build.f_cpu=48000000L
mattairtech_xeno_mini.menu.cpu.samc21g15a.build.usb_product="Xeno Mini C21"
mattairtech_xeno_mini.menu.cpu.samc21g15a.build.extra_flags=-D__SAMC21G15A__ -DARM_MATH_CM0PLUS
mattairtech_xeno_mini.menu.cpu.samc21g15a.build.ldscript=flash_32KB.ld
mattairtech_xeno_mini.menu.cpu.samc21g15a.build.openocdscript=openocd_scripts/SAMC21G15A.cfg
mattairtech_xeno_mini.menu.cpu.samc21g15a.bootloader.file=zero/binaries/sam_ba_Xeno_Mini_SAMC21G15A.bin
mattairtech_xeno_mini.menu.bootloader.8kb=8KB_BOOTLOADER
mattairtech_xeno_mini.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
mattairtech_xeno_mini.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
mattairtech_xeno_mini.menu.bootloader.8kb.upload.tool=MattairTech_Arduino:bossac
mattairtech_xeno_mini.menu.bootloader.8kb.upload.use_1200bps_touch=true
mattairtech_xeno_mini.menu.bootloader.8kb.upload.wait_for_upload_port=true
mattairtech_xeno_mini.menu.bootloader.8kb.upload.native_usb=true
mattairtech_xeno_mini.menu.bootloader.16kb=16KB_BOOTLOADER
mattairtech_xeno_mini.menu.bootloader.16kb.build.bootloader_size=__16KB_BOOTLOADER__
mattairtech_xeno_mini.menu.bootloader.16kb.build.ldscript_path=linker_scripts/gcc/16KB_Bootloader
mattairtech_xeno_mini.menu.bootloader.16kb.upload.tool=MattairTech_Arduino:bossac
mattairtech_xeno_mini.menu.bootloader.16kb.upload.use_1200bps_touch=true
mattairtech_xeno_mini.menu.bootloader.16kb.upload.wait_for_upload_port=true
mattairtech_xeno_mini.menu.bootloader.16kb.upload.native_usb=true
mattairtech_xeno_mini.menu.bootloader.0kb=NO_BOOTLOADER
mattairtech_xeno_mini.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
mattairtech_xeno_mini.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
mattairtech_xeno_mini.menu.bootloader.0kb.upload.tool=arduino:openocd
mattairtech_xeno_mini.menu.bootloader.0kb.upload.use_1200bps_touch=false
mattairtech_xeno_mini.menu.bootloader.0kb.upload.wait_for_upload_port=false
mattairtech_xeno_mini.menu.bootloader.0kb.upload.native_usb=false
mattairtech_xeno_mini.menu.serial.one_uart=ONE_UART_ONE_WIRE_ONE_SPI
mattairtech_xeno_mini.menu.serial.one_uart.build.serialcom_uart=ONE_UART
mattairtech_xeno_mini.menu.serial.one_uart.build.serialcom_wire=ONE_WIRE
mattairtech_xeno_mini.menu.serial.one_uart.build.serialcom_spi=ONE_SPI
mattairtech_xeno_mini.menu.serial.one_uart_two_spi=ONE_UART_ONE_WIRE_TWO_SPI
mattairtech_xeno_mini.menu.serial.one_uart_two_spi.build.serialcom_uart=ONE_UART
mattairtech_xeno_mini.menu.serial.one_uart_two_spi.build.serialcom_wire=ONE_WIRE
mattairtech_xeno_mini.menu.serial.one_uart_two_spi.build.serialcom_spi=TWO_SPI
mattairtech_xeno_mini.menu.serial.one_uart_two_wire=ONE_UART_TWO_WIRE_ONE_SPI
mattairtech_xeno_mini.menu.serial.one_uart_two_wire.build.serialcom_uart=ONE_UART
mattairtech_xeno_mini.menu.serial.one_uart_two_wire.build.serialcom_wire=TWO_WIRE
mattairtech_xeno_mini.menu.serial.one_uart_two_wire.build.serialcom_spi=ONE_SPI
mattairtech_xeno_mini.menu.serial.two_uart=TWO_UART_ONE_WIRE_ONE_SPI
mattairtech_xeno_mini.menu.serial.two_uart.build.serialcom_uart=TWO_UART
mattairtech_xeno_mini.menu.serial.two_uart.build.serialcom_wire=ONE_WIRE
mattairtech_xeno_mini.menu.serial.two_uart.build.serialcom_spi=ONE_SPI
mattairtech_xeno_mini.menu.serial.two_uart_two_spi=TWO_UART_ONE_WIRE_TWO_SPI
mattairtech_xeno_mini.menu.serial.two_uart_two_spi.build.serialcom_uart=TWO_UART
mattairtech_xeno_mini.menu.serial.two_uart_two_spi.build.serialcom_wire=ONE_WIRE
mattairtech_xeno_mini.menu.serial.two_uart_two_spi.build.serialcom_spi=TWO_SPI
mattairtech_xeno_mini.menu.serial.two_uart_two_wire=TWO_UART_TWO_WIRE_ONE_SPI
mattairtech_xeno_mini.menu.serial.two_uart_two_wire.build.serialcom_uart=TWO_UART
mattairtech_xeno_mini.menu.serial.two_uart_two_wire.build.serialcom_wire=TWO_WIRE
mattairtech_xeno_mini.menu.serial.two_uart_two_wire.build.serialcom_spi=ONE_SPI
mattairtech_xeno_mini.menu.serial.three_uart=THREE_UART_ONE_WIRE_ONE_SPI
mattairtech_xeno_mini.menu.serial.three_uart.build.serialcom_uart=THREE_UART
mattairtech_xeno_mini.menu.serial.three_uart.build.serialcom_wire=ONE_WIRE
mattairtech_xeno_mini.menu.serial.three_uart.build.serialcom_spi=ONE_SPI
mattairtech_xeno_mini.menu.serial.three_uart_two_spi=THREE_UART_ONE_WIRE_TWO_SPI
mattairtech_xeno_mini.menu.serial.three_uart_two_spi.build.serialcom_uart=THREE_UART
mattairtech_xeno_mini.menu.serial.three_uart_two_spi.build.serialcom_wire=ONE_WIRE
mattairtech_xeno_mini.menu.serial.three_uart_two_spi.build.serialcom_spi=TWO_SPI
mattairtech_xeno_mini.menu.serial.three_uart_two_wire=THREE_UART_TWO_WIRE_ONE_SPI
mattairtech_xeno_mini.menu.serial.three_uart_two_wire.build.serialcom_uart=THREE_UART
mattairtech_xeno_mini.menu.serial.three_uart_two_wire.build.serialcom_wire=TWO_WIRE
mattairtech_xeno_mini.menu.serial.three_uart_two_wire.build.serialcom_spi=ONE_SPI
mattairtech_xeno_mini.menu.serial.no_uart=NO_UART_ONE_WIRE_ONE_SPI
mattairtech_xeno_mini.menu.serial.no_uart.build.serialcom_uart=NO_UART
mattairtech_xeno_mini.menu.serial.no_uart.build.serialcom_wire=ONE_WIRE
mattairtech_xeno_mini.menu.serial.no_uart.build.serialcom_spi=ONE_SPI
mattairtech_xeno_mini.menu.usb.cdc=CDC_ONLY
mattairtech_xeno_mini.menu.usb.cdc.build.usbcom=CDC_ONLY
mattairtech_xeno_mini.menu.usb.cdc.build.pid=0x0557
mattairtech_xeno_mini.menu.usb.cdc_hid=CDC_HID
mattairtech_xeno_mini.menu.usb.cdc_hid.build.usbcom=CDC_HID
mattairtech_xeno_mini.menu.usb.cdc_hid.build.pid=0x0856
mattairtech_xeno_mini.menu.usb.withcdc=WITH_CDC
mattairtech_xeno_mini.menu.usb.withcdc.build.usbcom=WITH_CDC
mattairtech_xeno_mini.menu.usb.withcdc.build.pid=0x0B41
mattairtech_xeno_mini.menu.usb.hid=HID_ONLY
mattairtech_xeno_mini.menu.usb.hid.build.usbcom=HID_ONLY
mattairtech_xeno_mini.menu.usb.hid.build.pid=0x0B40
mattairtech_xeno_mini.menu.usb.nocdc=WITHOUT_CDC
mattairtech_xeno_mini.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
mattairtech_xeno_mini.menu.usb.nocdc.build.pid=0x0A0C
mattairtech_xeno_mini.menu.usb.none=USB_DISABLED
mattairtech_xeno_mini.menu.usb.none.build.usbcom=USB_DISABLED
mattairtech_xeno_mini.menu.usb.none.build.pid=0x0856


