arduino/ArduinoCore-samd/boards.txt
# MattairTech Xeno
mattairtech_xeno.name=MattairTech Xeno
mattairtech_xeno.vid.0=0x16D0
mattairtech_xeno.pid.0=0x0557
mattairtech_xeno.vid.1=0x16D0
mattairtech_xeno.pid.1=0x0856
mattairtech_xeno.vid.2=0x16D0
mattairtech_xeno.pid.2=0x0B41
mattairtech_xeno.vid.3=0x16D0
mattairtech_xeno.pid.3=0x0B40
mattairtech_xeno.vid.4=0x16D0
mattairtech_xeno.pid.4=0x0A0C
mattairtech_xeno.vid.5=0x16D0
mattairtech_xeno.pid.5=0x0856
mattairtech_xeno.build.usb_manufacturer="MattairTech LLC"
mattairtech_xeno.build.board=SAMD_ZERO
mattairtech_xeno.build.core=arduino
mattairtech_xeno.build.variant=Xeno
mattairtech_xeno.build.variant_system_lib=
mattairtech_xeno.build.vid=0x16D0
mattairtech_xeno.upload.protocol=sam-ba
mattairtech_xeno.bootloader.tool=arduino:openocd
mattairtech_xeno.menu.float.default=Print & String use auto-promoted doubles only
mattairtech_xeno.menu.float.default.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
mattairtech_xeno.menu.float.print=Print uses separate singles and doubles
mattairtech_xeno.menu.float.print.build.floatconfig=FLOAT_PRINT_SINGLES_DOUBLES
mattairtech_xeno.menu.float.string=String uses separate singles and doubles
mattairtech_xeno.menu.float.string.build.floatconfig=FLOAT_STRING_SINGLES_DOUBLES
mattairtech_xeno.menu.float.both=Print & String use separate singles and doubles
mattairtech_xeno.menu.float.both.build.floatconfig=FLOAT_BOTH_SINGLES_DOUBLES
mattairtech_xeno.menu.config.disabled=config.h disabled
mattairtech_xeno.menu.config.disabled.build.buildconfig=CONFIG_H_DISABLED
mattairtech_xeno.menu.config.enabled=config.h enabled (mostly code size reductions)
mattairtech_xeno.menu.config.enabled.build.buildconfig=CONFIG_H_ENABLED
mattairtech_xeno.menu.clock.crystal_32k=32KHZ_CRYSTAL
mattairtech_xeno.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
mattairtech_xeno.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
mattairtech_xeno.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
mattairtech_xeno.menu.clock.internal=INTERNAL_OSCILLATOR
mattairtech_xeno.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
mattairtech_xeno.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
mattairtech_xeno.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
mattairtech_xeno.menu.timer.timer_732Hz=732.4Hz (16-bit)
mattairtech_xeno.menu.timer.timer_732Hz.build.timerconfig=TIMER_732Hz
mattairtech_xeno.menu.timer.timer_366Hz=366.2Hz (16-bit)
mattairtech_xeno.menu.timer.timer_366Hz.build.timerconfig=TIMER_366Hz
mattairtech_xeno.menu.timer.timer_244Hz=244.1Hz (16-bit)
mattairtech_xeno.menu.timer.timer_244Hz.build.timerconfig=TIMER_244Hz
mattairtech_xeno.menu.timer.timer_183Hz=183.1Hz (16-bit)
mattairtech_xeno.menu.timer.timer_183Hz.build.timerconfig=TIMER_183Hz
mattairtech_xeno.menu.timer.timer_146Hz=146.5Hz (16-bit)
mattairtech_xeno.menu.timer.timer_146Hz.build.timerconfig=TIMER_146Hz
mattairtech_xeno.menu.timer.timer_122Hz=122.1Hz (16-bit)
mattairtech_xeno.menu.timer.timer_122Hz.build.timerconfig=TIMER_122Hz
mattairtech_xeno.menu.timer.timer_105Hz=104.6Hz (16-bit)
mattairtech_xeno.menu.timer.timer_105Hz.build.timerconfig=TIMER_105Hz
mattairtech_xeno.menu.timer.timer_81Hz=81.38Hz (16-bit)
mattairtech_xeno.menu.timer.timer_81Hz.build.timerconfig=TIMER_81Hz
mattairtech_xeno.menu.timer.timer_61Hz=61.04Hz (16-bit)
mattairtech_xeno.menu.timer.timer_61Hz.build.timerconfig=TIMER_61Hz
mattairtech_xeno.menu.timer.timer_31Hz=30.52Hz (16-bit)
mattairtech_xeno.menu.timer.timer_31Hz.build.timerconfig=TIMER_31Hz
mattairtech_xeno.menu.timer.timer_187500Hz=187500Hz (8-bit)
mattairtech_xeno.menu.timer.timer_187500Hz.build.timerconfig=TIMER_187500Hz
mattairtech_xeno.menu.timer.timer_93750Hz=93750Hz (8-bit)
mattairtech_xeno.menu.timer.timer_93750Hz.build.timerconfig=TIMER_93750Hz
mattairtech_xeno.menu.timer.timer_62500Hz=62500Hz (8-bit)
mattairtech_xeno.menu.timer.timer_62500Hz.build.timerconfig=TIMER_62500Hz
mattairtech_xeno.menu.timer.timer_37500Hz=37500Hz (8-bit)
mattairtech_xeno.menu.timer.timer_37500Hz.build.timerconfig=TIMER_37500Hz
mattairtech_xeno.menu.timer.timer_20833Hz=20833Hz (8-bit)
mattairtech_xeno.menu.timer.timer_20833Hz.build.timerconfig=TIMER_20833Hz
mattairtech_xeno.menu.timer.timer_12500Hz=12500Hz (8-bit)
mattairtech_xeno.menu.timer.timer_12500Hz.build.timerconfig=TIMER_12500Hz
mattairtech_xeno.menu.timer.timer_7500Hz=7500Hz (8-bit)
mattairtech_xeno.menu.timer.timer_7500Hz.build.timerconfig=TIMER_7500Hz
mattairtech_xeno.menu.timer.timer_4166Hz=4166Hz (8-bit)
mattairtech_xeno.menu.timer.timer_4166Hz.build.timerconfig=TIMER_4166Hz
mattairtech_xeno.menu.timer.timer_2930Hz=2930Hz (8-bit)
mattairtech_xeno.menu.timer.timer_2930Hz.build.timerconfig=TIMER_2930Hz
mattairtech_xeno.menu.timer.timer_1465Hz=1465Hz (8-bit, 16-bit for D51)
mattairtech_xeno.menu.timer.timer_1465Hz.build.timerconfig=TIMER_1465Hz
mattairtech_xeno.menu.cpu.samd21j18a=SAMD21J18A
mattairtech_xeno.menu.cpu.samd21j18a.upload.maximum_size=253952
mattairtech_xeno.menu.cpu.samd21j18a.build.mcu=cortex-m0plus
mattairtech_xeno.menu.cpu.samd21j18a.build.mathlib=arm_cortexM0l_math
mattairtech_xeno.menu.cpu.samd21j18a.build.f_cpu=48000000L
mattairtech_xeno.menu.cpu.samd21j18a.build.usb_product="Xeno D21"
mattairtech_xeno.menu.cpu.samd21j18a.build.extra_flags=-D__SAMD21J18A__ {build.usb_flags} -DARM_MATH_CM0PLUS
mattairtech_xeno.menu.cpu.samd21j18a.build.ldscript=flash_256KB.ld
mattairtech_xeno.menu.cpu.samd21j18a.build.openocdscript=openocd_scripts/SAMD21J18A.cfg
mattairtech_xeno.menu.cpu.samd21j18a.bootloader.file=zero/binaries/sam_ba_Xeno_SAMD21J18A.bin
mattairtech_xeno.menu.cpu.samd21j17a=SAMD21J17A
mattairtech_xeno.menu.cpu.samd21j17a.upload.maximum_size=122880
mattairtech_xeno.menu.cpu.samd21j17a.build.mcu=cortex-m0plus
mattairtech_xeno.menu.cpu.samd21j17a.build.mathlib=arm_cortexM0l_math
mattairtech_xeno.menu.cpu.samd21j17a.build.f_cpu=48000000L
mattairtech_xeno.menu.cpu.samd21j17a.build.usb_product="Xeno D21"
mattairtech_xeno.menu.cpu.samd21j17a.build.extra_flags=-D__SAMD21J17A__ {build.usb_flags} -DARM_MATH_CM0PLUS
mattairtech_xeno.menu.cpu.samd21j17a.build.ldscript=flash_128KB.ld
mattairtech_xeno.menu.cpu.samd21j17a.build.openocdscript=openocd_scripts/SAMD21J17A.cfg
mattairtech_xeno.menu.cpu.samd21j17a.bootloader.file=zero/binaries/sam_ba_Xeno_SAMD21J17A.bin
mattairtech_xeno.menu.cpu.samd21j16a=SAMD21J16A
mattairtech_xeno.menu.cpu.samd21j16a.upload.maximum_size=57344
mattairtech_xeno.menu.cpu.samd21j16a.build.mcu=cortex-m0plus
mattairtech_xeno.menu.cpu.samd21j16a.build.mathlib=arm_cortexM0l_math
mattairtech_xeno.menu.cpu.samd21j16a.build.f_cpu=48000000L
mattairtech_xeno.menu.cpu.samd21j16a.build.usb_product="Xeno D21"
mattairtech_xeno.menu.cpu.samd21j16a.build.extra_flags=-D__SAMD21J16A__ {build.usb_flags} -DARM_MATH_CM0PLUS
mattairtech_xeno.menu.cpu.samd21j16a.build.ldscript=flash_64KB.ld
mattairtech_xeno.menu.cpu.samd21j16a.build.openocdscript=openocd_scripts/SAMD21J16A.cfg
mattairtech_xeno.menu.cpu.samd21j16a.bootloader.file=zero/binaries/sam_ba_Xeno_SAMD21J16A.bin
mattairtech_xeno.menu.cpu.samd21j15a=SAMD21J15A
mattairtech_xeno.menu.cpu.samd21j15a.upload.maximum_size=24576
mattairtech_xeno.menu.cpu.samd21j15a.build.mcu=cortex-m0plus
mattairtech_xeno.menu.cpu.samd21j15a.build.mathlib=arm_cortexM0l_math
mattairtech_xeno.menu.cpu.samd21j15a.build.f_cpu=48000000L
mattairtech_xeno.menu.cpu.samd21j15a.build.usb_product="Xeno D21"
mattairtech_xeno.menu.cpu.samd21j15a.build.extra_flags=-D__SAMD21J15A__ {build.usb_flags} -DARM_MATH_CM0PLUS
mattairtech_xeno.menu.cpu.samd21j15a.build.ldscript=flash_32KB.ld
mattairtech_xeno.menu.cpu.samd21j15a.build.openocdscript=openocd_scripts/SAMD21J15A.cfg
mattairtech_xeno.menu.cpu.samd21j15a.bootloader.file=zero/binaries/sam_ba_Xeno_SAMD21J15A.bin
mattairtech_xeno.menu.cpu.samd51j20a_120=SAMD51J20A_120MHz
mattairtech_xeno.menu.cpu.samd51j20a_120.upload.maximum_size=1040384
mattairtech_xeno.menu.cpu.samd51j20a_120.build.mcu=cortex-m4
mattairtech_xeno.menu.cpu.samd51j20a_120.build.mathlib=arm_cortexM4lf_math
mattairtech_xeno.menu.cpu.samd51j20a_120.build.f_cpu=120000000L
mattairtech_xeno.menu.cpu.samd51j20a_120.build.usb_product="Xeno D51"
mattairtech_xeno.menu.cpu.samd51j20a_120.build.extra_flags=-D__SAMD51J20A__ {build.usb_flags} -mfloat-abi=softfp -mfpu=fpv4-sp-d16 -DARM_MATH_CM4
mattairtech_xeno.menu.cpu.samd51j20a_120.build.ldscript=flash_m4f_1MB.ld
mattairtech_xeno.menu.cpu.samd51j20a_120.build.openocdscript=openocd_scripts/SAMD51J20A.cfg
mattairtech_xeno.menu.cpu.samd51j20a_120.bootloader.file=zero/binaries/sam_ba_Xeno_SAMD51J20A.bin
mattairtech_xeno.menu.cpu.samd51j20a_48=SAMD51J20A_48MHz
mattairtech_xeno.menu.cpu.samd51j20a_48.upload.maximum_size=1040384
mattairtech_xeno.menu.cpu.samd51j20a_48.build.mcu=cortex-m4
mattairtech_xeno.menu.cpu.samd51j20a_48.build.mathlib=arm_cortexM4lf_math
mattairtech_xeno.menu.cpu.samd51j20a_48.build.f_cpu=48000000L
mattairtech_xeno.menu.cpu.samd51j20a_48.build.usb_product="Xeno D51"
mattairtech_xeno.menu.cpu.samd51j20a_48.build.extra_flags=-D__SAMD51J20A__ {build.usb_flags} -mfloat-abi=softfp -mfpu=fpv4-sp-d16 -DARM_MATH_CM4
mattairtech_xeno.menu.cpu.samd51j20a_48.build.ldscript=flash_m4f_1MB.ld
mattairtech_xeno.menu.cpu.samd51j20a_48.build.openocdscript=openocd_scripts/SAMD51J20A.cfg
mattairtech_xeno.menu.cpu.samd51j20a_48.bootloader.file=zero/binaries/sam_ba_Xeno_SAMD51J20A.bin
mattairtech_xeno.menu.cpu.samd51j19a_120=SAMD51J19A_120MHz
mattairtech_xeno.menu.cpu.samd51j19a_120.upload.maximum_size=516096
mattairtech_xeno.menu.cpu.samd51j19a_120.build.mcu=cortex-m4
mattairtech_xeno.menu.cpu.samd51j19a_120.build.mathlib=arm_cortexM4lf_math
mattairtech_xeno.menu.cpu.samd51j19a_120.build.f_cpu=120000000L
mattairtech_xeno.menu.cpu.samd51j19a_120.build.usb_product="Xeno D51"
mattairtech_xeno.menu.cpu.samd51j19a_120.build.extra_flags=-D__SAMD51J19A__ {build.usb_flags} -mfloat-abi=softfp -mfpu=fpv4-sp-d16 -DARM_MATH_CM4
mattairtech_xeno.menu.cpu.samd51j19a_120.build.ldscript=flash_m4f_512KB.ld
mattairtech_xeno.menu.cpu.samd51j19a_120.build.openocdscript=openocd_scripts/SAMD51J19A.cfg
mattairtech_xeno.menu.cpu.samd51j19a_120.bootloader.file=zero/binaries/sam_ba_Xeno_SAMD51J19A.bin
mattairtech_xeno.menu.cpu.samd51j19a_48=SAMD51J19A_48MHz
mattairtech_xeno.menu.cpu.samd51j19a_48.upload.maximum_size=516096
mattairtech_xeno.menu.cpu.samd51j19a_48.build.mcu=cortex-m4
mattairtech_xeno.menu.cpu.samd51j19a_48.build.mathlib=arm_cortexM4lf_math
mattairtech_xeno.menu.cpu.samd51j19a_48.build.f_cpu=48000000L
mattairtech_xeno.menu.cpu.samd51j19a_48.build.usb_product="Xeno D51"
mattairtech_xeno.menu.cpu.samd51j19a_48.build.extra_flags=-D__SAMD51J19A__ {build.usb_flags} -mfloat-abi=softfp -mfpu=fpv4-sp-d16 -DARM_MATH_CM4
mattairtech_xeno.menu.cpu.samd51j19a_48.build.ldscript=flash_m4f_512KB.ld
mattairtech_xeno.menu.cpu.samd51j19a_48.build.openocdscript=openocd_scripts/SAMD51J19A.cfg
mattairtech_xeno.menu.cpu.samd51j19a_48.bootloader.file=zero/binaries/sam_ba_Xeno_SAMD51J19A.bin
mattairtech_xeno.menu.cpu.samd51j18a_120=SAMD51J18A_120MHz
mattairtech_xeno.menu.cpu.samd51j18a_120.upload.maximum_size=253952
mattairtech_xeno.menu.cpu.samd51j18a_120.build.mcu=cortex-m4
mattairtech_xeno.menu.cpu.samd51j18a_120.build.mathlib=arm_cortexM4lf_math
mattairtech_xeno.menu.cpu.samd51j18a_120.build.f_cpu=120000000L
mattairtech_xeno.menu.cpu.samd51j18a_120.build.usb_product="Xeno D51"
mattairtech_xeno.menu.cpu.samd51j18a_120.build.extra_flags=-D__SAMD51J18A__ {build.usb_flags} -mfloat-abi=softfp -mfpu=fpv4-sp-d16 -DARM_MATH_CM4
mattairtech_xeno.menu.cpu.samd51j18a_120.build.ldscript=flash_m4f_256KB.ld
mattairtech_xeno.menu.cpu.samd51j18a_120.build.openocdscript=openocd_scripts/SAMD51J18A.cfg
mattairtech_xeno.menu.cpu.samd51j18a_120.bootloader.file=zero/binaries/sam_ba_Xeno_SAMD51J18A.bin
mattairtech_xeno.menu.cpu.samd51j18a_48=SAMD51J18A_48MHz
mattairtech_xeno.menu.cpu.samd51j18a_48.upload.maximum_size=253952
mattairtech_xeno.menu.cpu.samd51j18a_48.build.mcu=cortex-m4
mattairtech_xeno.menu.cpu.samd51j18a_48.build.mathlib=arm_cortexM4lf_math
mattairtech_xeno.menu.cpu.samd51j18a_48.build.f_cpu=48000000L
mattairtech_xeno.menu.cpu.samd51j18a_48.build.usb_product="Xeno D51"
mattairtech_xeno.menu.cpu.samd51j18a_48.build.extra_flags=-D__SAMD51J18A__ {build.usb_flags} -mfloat-abi=softfp -mfpu=fpv4-sp-d16 -DARM_MATH_CM4
mattairtech_xeno.menu.cpu.samd51j18a_48.build.ldscript=flash_m4f_256KB.ld
mattairtech_xeno.menu.cpu.samd51j18a_48.build.openocdscript=openocd_scripts/SAMD51J18A.cfg
mattairtech_xeno.menu.cpu.samd51j18a_48.bootloader.file=zero/binaries/sam_ba_Xeno_SAMD51J18A.bin
mattairtech_xeno.menu.cpu.saml21j18b=SAML21J18B
mattairtech_xeno.menu.cpu.saml21j18b.upload.maximum_size=253952
mattairtech_xeno.menu.cpu.saml21j18b.build.mcu=cortex-m0plus
mattairtech_xeno.menu.cpu.saml21j18b.build.mathlib=arm_cortexM0l_math
mattairtech_xeno.menu.cpu.saml21j18b.build.f_cpu=48000000L
mattairtech_xeno.menu.cpu.saml21j18b.build.usb_product="Xeno L21"
mattairtech_xeno.menu.cpu.saml21j18b.build.extra_flags=-D__SAML21J18B__ {build.usb_flags} -DARM_MATH_CM0PLUS
mattairtech_xeno.menu.cpu.saml21j18b.build.ldscript=flash_256KB.ld
mattairtech_xeno.menu.cpu.saml21j18b.build.openocdscript=openocd_scripts/SAML21J18B.cfg
mattairtech_xeno.menu.cpu.saml21j18b.bootloader.file=zero/binaries/sam_ba_Xeno_SAML21J18B.bin
mattairtech_xeno.menu.cpu.saml21j17b=SAML21J17B
mattairtech_xeno.menu.cpu.saml21j17b.upload.maximum_size=122880
mattairtech_xeno.menu.cpu.saml21j17b.build.mcu=cortex-m0plus
mattairtech_xeno.menu.cpu.saml21j17b.build.mathlib=arm_cortexM0l_math
mattairtech_xeno.menu.cpu.saml21j17b.build.f_cpu=48000000L
mattairtech_xeno.menu.cpu.saml21j17b.build.usb_product="Xeno L21"
mattairtech_xeno.menu.cpu.saml21j17b.build.extra_flags=-D__SAML21J17B__ {build.usb_flags} -DARM_MATH_CM0PLUS
mattairtech_xeno.menu.cpu.saml21j17b.build.ldscript=flash_128KB.ld
mattairtech_xeno.menu.cpu.saml21j17b.build.openocdscript=openocd_scripts/SAML21J17B.cfg
mattairtech_xeno.menu.cpu.saml21j17b.bootloader.file=zero/binaries/sam_ba_Xeno_SAML21J17B.bin
mattairtech_xeno.menu.cpu.saml21j16b=SAML21J16B
mattairtech_xeno.menu.cpu.saml21j16b.upload.maximum_size=57344
mattairtech_xeno.menu.cpu.saml21j16b.build.mcu=cortex-m0plus
mattairtech_xeno.menu.cpu.saml21j16b.build.mathlib=arm_cortexM0l_math
mattairtech_xeno.menu.cpu.saml21j16b.build.f_cpu=48000000L
mattairtech_xeno.menu.cpu.saml21j16b.build.usb_product="Xeno L21"
mattairtech_xeno.menu.cpu.saml21j16b.build.extra_flags=-D__SAML21J16B__ {build.usb_flags} -DARM_MATH_CM0PLUS
mattairtech_xeno.menu.cpu.saml21j16b.build.ldscript=flash_64KB.ld
mattairtech_xeno.menu.cpu.saml21j16b.build.openocdscript=openocd_scripts/SAML21J16B.cfg
mattairtech_xeno.menu.cpu.saml21j16b.bootloader.file=zero/binaries/sam_ba_Xeno_SAML21J16B.bin
mattairtech_xeno.menu.cpu.samc21j18a=SAMC21J18A
mattairtech_xeno.menu.cpu.samc21j18a.upload.maximum_size=253952
mattairtech_xeno.menu.cpu.samc21j18a.build.mcu=cortex-m0plus
mattairtech_xeno.menu.cpu.samc21j18a.build.mathlib=arm_cortexM0l_math
mattairtech_xeno.menu.cpu.samc21j18a.build.f_cpu=48000000L
mattairtech_xeno.menu.cpu.samc21j18a.build.usb_product="Xeno C21"
mattairtech_xeno.menu.cpu.samc21j18a.build.extra_flags=-D__SAMC21J18A__ -DARM_MATH_CM0PLUS
mattairtech_xeno.menu.cpu.samc21j18a.build.ldscript=flash_256KB.ld
mattairtech_xeno.menu.cpu.samc21j18a.build.openocdscript=openocd_scripts/SAMC21J18A.cfg
mattairtech_xeno.menu.cpu.samc21j18a.bootloader.file=zero/binaries/sam_ba_Xeno_SAMC21J18A.bin
mattairtech_xeno.menu.cpu.samc21j17a=SAMC21J17A
mattairtech_xeno.menu.cpu.samc21j17a.upload.maximum_size=122880
mattairtech_xeno.menu.cpu.samc21j17a.build.mcu=cortex-m0plus
mattairtech_xeno.menu.cpu.samc21j17a.build.mathlib=arm_cortexM0l_math
mattairtech_xeno.menu.cpu.samc21j17a.build.f_cpu=48000000L
mattairtech_xeno.menu.cpu.samc21j17a.build.usb_product="Xeno C21"
mattairtech_xeno.menu.cpu.samc21j17a.build.extra_flags=-D__SAMC21J17A__ -DARM_MATH_CM0PLUS
mattairtech_xeno.menu.cpu.samc21j17a.build.ldscript=flash_128KB.ld
mattairtech_xeno.menu.cpu.samc21j17a.build.openocdscript=openocd_scripts/SAMC21J17A.cfg
mattairtech_xeno.menu.cpu.samc21j17a.bootloader.file=zero/binaries/sam_ba_Xeno_SAMC21J17A.bin
mattairtech_xeno.menu.cpu.samc21j16a=SAMC21J16A
mattairtech_xeno.menu.cpu.samc21j16a.upload.maximum_size=57344
mattairtech_xeno.menu.cpu.samc21j16a.build.mcu=cortex-m0plus
mattairtech_xeno.menu.cpu.samc21j16a.build.mathlib=arm_cortexM0l_math
mattairtech_xeno.menu.cpu.samc21j16a.build.f_cpu=48000000L
mattairtech_xeno.menu.cpu.samc21j16a.build.usb_product="Xeno C21"
mattairtech_xeno.menu.cpu.samc21j16a.build.extra_flags=-D__SAMC21J16A__ -DARM_MATH_CM0PLUS
mattairtech_xeno.menu.cpu.samc21j16a.build.ldscript=flash_64KB.ld
mattairtech_xeno.menu.cpu.samc21j16a.build.openocdscript=openocd_scripts/SAMC21J16A.cfg
mattairtech_xeno.menu.cpu.samc21j16a.bootloader.file=zero/binaries/sam_ba_Xeno_SAMC21J16A.bin
mattairtech_xeno.menu.cpu.samc21j15a=SAMC21J15A
mattairtech_xeno.menu.cpu.samc21j15a.upload.maximum_size=24576
mattairtech_xeno.menu.cpu.samc21j15a.build.mcu=cortex-m0plus
mattairtech_xeno.menu.cpu.samc21j15a.build.mathlib=arm_cortexM0l_math
mattairtech_xeno.menu.cpu.samc21j15a.build.f_cpu=48000000L
mattairtech_xeno.menu.cpu.samc21j15a.build.usb_product="Xeno C21"
mattairtech_xeno.menu.cpu.samc21j15a.build.extra_flags=-D__SAMC21J15A__ -DARM_MATH_CM0PLUS
mattairtech_xeno.menu.cpu.samc21j15a.build.ldscript=flash_32KB.ld
mattairtech_xeno.menu.cpu.samc21j15a.build.openocdscript=openocd_scripts/SAMC21J15A.cfg
mattairtech_xeno.menu.cpu.samc21j15a.bootloader.file=zero/binaries/sam_ba_Xeno_SAMC21J15A.bin
mattairtech_xeno.menu.bootloader.8kb=8KB_BOOTLOADER
mattairtech_xeno.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
mattairtech_xeno.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
mattairtech_xeno.menu.bootloader.8kb.upload.tool=MattairTech_Arduino:bossac
mattairtech_xeno.menu.bootloader.8kb.upload.use_1200bps_touch=true
mattairtech_xeno.menu.bootloader.8kb.upload.wait_for_upload_port=true
