arduino/ArduinoCore-samd/boards.txt
mattairtech_mt_d21e_revb.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
mattairtech_mt_d21e_revb.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
mattairtech_mt_d21e_revb.menu.bootloader.0kb.upload.tool=arduino:openocd
mattairtech_mt_d21e_revb.menu.bootloader.0kb.upload.use_1200bps_touch=false
mattairtech_mt_d21e_revb.menu.bootloader.0kb.upload.wait_for_upload_port=false
mattairtech_mt_d21e_revb.menu.bootloader.0kb.upload.native_usb=false
mattairtech_mt_d21e_revb.menu.serial.one_uart=ONE_UART_ONE_WIRE_ONE_SPI
mattairtech_mt_d21e_revb.menu.serial.one_uart.build.serialcom_uart=ONE_UART
mattairtech_mt_d21e_revb.menu.serial.one_uart.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d21e_revb.menu.serial.one_uart.build.serialcom_spi=ONE_SPI
mattairtech_mt_d21e_revb.menu.serial.one_uart_one_wire_two_spi=ONE_UART_ONE_WIRE_TWO_SPI
mattairtech_mt_d21e_revb.menu.serial.one_uart_one_wire_two_spi.build.serialcom_uart=ONE_UART
mattairtech_mt_d21e_revb.menu.serial.one_uart_one_wire_two_spi.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d21e_revb.menu.serial.one_uart_one_wire_two_spi.build.serialcom_spi=TWO_SPI
mattairtech_mt_d21e_revb.menu.serial.one_uart_two_wire_one_spi=ONE_UART_TWO_WIRE_ONE_SPI
mattairtech_mt_d21e_revb.menu.serial.one_uart_two_wire_one_spi.build.serialcom_uart=ONE_UART
mattairtech_mt_d21e_revb.menu.serial.one_uart_two_wire_one_spi.build.serialcom_wire=TWO_WIRE
mattairtech_mt_d21e_revb.menu.serial.one_uart_two_wire_one_spi.build.serialcom_spi=ONE_SPI
mattairtech_mt_d21e_revb.menu.serial.two_uart=TWO_UART_ONE_WIRE_ONE_SPI
mattairtech_mt_d21e_revb.menu.serial.two_uart.build.serialcom_uart=TWO_UART
mattairtech_mt_d21e_revb.menu.serial.two_uart.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d21e_revb.menu.serial.two_uart.build.serialcom_spi=ONE_SPI
mattairtech_mt_d21e_revb.menu.serial.three_uart_one_wire_no_spi=THREE_UART_ONE_WIRE_NO_SPI
mattairtech_mt_d21e_revb.menu.serial.three_uart_one_wire_no_spi.build.serialcom_uart=THREE_UART
mattairtech_mt_d21e_revb.menu.serial.three_uart_one_wire_no_spi.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d21e_revb.menu.serial.three_uart_one_wire_no_spi.build.serialcom_spi=NO_SPI
mattairtech_mt_d21e_revb.menu.serial.three_uart_no_wire_one_spi=THREE_UART_NO_WIRE_ONE_SPI
mattairtech_mt_d21e_revb.menu.serial.three_uart_no_wire_one_spi.build.serialcom_uart=THREE_UART
mattairtech_mt_d21e_revb.menu.serial.three_uart_no_wire_one_spi.build.serialcom_wire=NO_WIRE
mattairtech_mt_d21e_revb.menu.serial.three_uart_no_wire_one_spi.build.serialcom_spi=ONE_SPI
mattairtech_mt_d21e_revb.menu.serial.four_uart=FOUR_UART_NO_WIRE_NO_SPI
mattairtech_mt_d21e_revb.menu.serial.four_uart.build.serialcom_uart=FOUR_UART
mattairtech_mt_d21e_revb.menu.serial.four_uart.build.serialcom_wire=NO_WIRE
mattairtech_mt_d21e_revb.menu.serial.four_uart.build.serialcom_spi=NO_SPI
mattairtech_mt_d21e_revb.menu.serial.no_uart_one_wire_two_spi=NO_UART_ONE_WIRE_TWO_SPI
mattairtech_mt_d21e_revb.menu.serial.no_uart_one_wire_two_spi.build.serialcom_uart=NO_UART
mattairtech_mt_d21e_revb.menu.serial.no_uart_one_wire_two_spi.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d21e_revb.menu.serial.no_uart_one_wire_two_spi.build.serialcom_spi=TWO_SPI
mattairtech_mt_d21e_revb.menu.serial.four_uart_one_wire_one_spi=FOUR_UART_ONE_WIRE_ONE_SPI (L21 only)
mattairtech_mt_d21e_revb.menu.serial.four_uart_one_wire_one_spi.build.serialcom_uart=FOUR_UART
mattairtech_mt_d21e_revb.menu.serial.four_uart_one_wire_one_spi.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d21e_revb.menu.serial.four_uart_one_wire_one_spi.build.serialcom_spi=ONE_SPI
mattairtech_mt_d21e_revb.menu.serial.five_uart_no_wire_one_spi=FIVE_UART_NO_WIRE_ONE_SPI (L21 only)
mattairtech_mt_d21e_revb.menu.serial.five_uart_no_wire_one_spi.build.serialcom_uart=FIVE_UART
mattairtech_mt_d21e_revb.menu.serial.five_uart_no_wire_one_spi.build.serialcom_wire=NO_WIRE
mattairtech_mt_d21e_revb.menu.serial.five_uart_no_wire_one_spi.build.serialcom_spi=ONE_SPI
mattairtech_mt_d21e_revb.menu.serial.five_uart_one_wire_no_spi=FIVE_UART_ONE_WIRE_NO_SPI (L21 only)
mattairtech_mt_d21e_revb.menu.serial.five_uart_one_wire_no_spi.build.serialcom_uart=FIVE_UART
mattairtech_mt_d21e_revb.menu.serial.five_uart_one_wire_no_spi.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d21e_revb.menu.serial.five_uart_one_wire_no_spi.build.serialcom_spi=NO_SPI
mattairtech_mt_d21e_revb.menu.serial.six_uart=SIX_UART_NO_WIRE_NO_SPI (L21 only)
mattairtech_mt_d21e_revb.menu.serial.six_uart.build.serialcom_uart=SIX_UART
mattairtech_mt_d21e_revb.menu.serial.six_uart.build.serialcom_wire=NO_WIRE
mattairtech_mt_d21e_revb.menu.serial.six_uart.build.serialcom_spi=NO_SPI
mattairtech_mt_d21e_revb.menu.usb.cdc=CDC_ONLY
mattairtech_mt_d21e_revb.menu.usb.cdc.build.usbcom=CDC_ONLY
mattairtech_mt_d21e_revb.menu.usb.cdc.build.pid=0x0557
mattairtech_mt_d21e_revb.menu.usb.cdc_hid=CDC_HID
mattairtech_mt_d21e_revb.menu.usb.cdc_hid.build.usbcom=CDC_HID
mattairtech_mt_d21e_revb.menu.usb.cdc_hid.build.pid=0x0856
mattairtech_mt_d21e_revb.menu.usb.withcdc=WITH_CDC
mattairtech_mt_d21e_revb.menu.usb.withcdc.build.usbcom=WITH_CDC
mattairtech_mt_d21e_revb.menu.usb.withcdc.build.pid=0x0B41
mattairtech_mt_d21e_revb.menu.usb.hid=HID_ONLY
mattairtech_mt_d21e_revb.menu.usb.hid.build.usbcom=HID_ONLY
mattairtech_mt_d21e_revb.menu.usb.hid.build.pid=0x0B40
mattairtech_mt_d21e_revb.menu.usb.nocdc=WITHOUT_CDC
mattairtech_mt_d21e_revb.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
mattairtech_mt_d21e_revb.menu.usb.nocdc.build.pid=0x0A0C
mattairtech_mt_d21e_revb.menu.usb.none=USB_DISABLED
mattairtech_mt_d21e_revb.menu.usb.none.build.usbcom=USB_DISABLED
mattairtech_mt_d21e_revb.menu.usb.none.build.pid=0x0856


# MattairTech MT-D21E
mattairtech_mt_d21e.name=MattairTech MT-D21E (rev A)
mattairtech_mt_d21e.vid.0=0x16D0
mattairtech_mt_d21e.pid.0=0x0557
mattairtech_mt_d21e.vid.1=0x16D0
mattairtech_mt_d21e.pid.1=0x0856
mattairtech_mt_d21e.vid.2=0x16D0
mattairtech_mt_d21e.pid.2=0x0B41
mattairtech_mt_d21e.vid.3=0x16D0
mattairtech_mt_d21e.pid.3=0x0B40
mattairtech_mt_d21e.vid.4=0x16D0
mattairtech_mt_d21e.pid.4=0x0A0C
mattairtech_mt_d21e.vid.5=0x16D0
mattairtech_mt_d21e.pid.5=0x0856
mattairtech_mt_d21e.build.mcu=cortex-m0plus
mattairtech_mt_d21e.build.mathlib=arm_cortexM0l_math
mattairtech_mt_d21e.build.f_cpu=48000000L
mattairtech_mt_d21e.build.usb_product="MT-D21E Rev A"
mattairtech_mt_d21e.build.usb_manufacturer="MattairTech LLC"
mattairtech_mt_d21e.build.board=SAMD_ZERO
mattairtech_mt_d21e.build.core=arduino
mattairtech_mt_d21e.build.variant=MT_D21E
mattairtech_mt_d21e.build.variant_system_lib=
mattairtech_mt_d21e.build.vid=0x16D0
mattairtech_mt_d21e.upload.protocol=sam-ba
mattairtech_mt_d21e.bootloader.tool=arduino:openocd
mattairtech_mt_d21e.menu.float.default=Print & String use auto-promoted doubles only
mattairtech_mt_d21e.menu.float.default.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
mattairtech_mt_d21e.menu.float.print=Print uses separate singles and doubles
mattairtech_mt_d21e.menu.float.print.build.floatconfig=FLOAT_PRINT_SINGLES_DOUBLES
mattairtech_mt_d21e.menu.float.string=String uses separate singles and doubles
mattairtech_mt_d21e.menu.float.string.build.floatconfig=FLOAT_STRING_SINGLES_DOUBLES
mattairtech_mt_d21e.menu.float.both=Print & String use separate singles and doubles
mattairtech_mt_d21e.menu.float.both.build.floatconfig=FLOAT_BOTH_SINGLES_DOUBLES
mattairtech_mt_d21e.menu.config.disabled=config.h disabled
mattairtech_mt_d21e.menu.config.disabled.build.buildconfig=CONFIG_H_DISABLED
mattairtech_mt_d21e.menu.config.enabled=config.h enabled (mostly code size reductions)
mattairtech_mt_d21e.menu.config.enabled.build.buildconfig=CONFIG_H_ENABLED
mattairtech_mt_d21e.menu.clock.crystal_32k=32KHZ_CRYSTAL
mattairtech_mt_d21e.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
mattairtech_mt_d21e.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
mattairtech_mt_d21e.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
mattairtech_mt_d21e.menu.clock.internal=INTERNAL_OSCILLATOR
mattairtech_mt_d21e.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
mattairtech_mt_d21e.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
mattairtech_mt_d21e.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
mattairtech_mt_d21e.menu.timer.timer_732Hz=732.4Hz (16-bit)
mattairtech_mt_d21e.menu.timer.timer_732Hz.build.timerconfig=TIMER_732Hz
mattairtech_mt_d21e.menu.timer.timer_366Hz=366.2Hz (16-bit)
mattairtech_mt_d21e.menu.timer.timer_366Hz.build.timerconfig=TIMER_366Hz
mattairtech_mt_d21e.menu.timer.timer_244Hz=244.1Hz (16-bit)
mattairtech_mt_d21e.menu.timer.timer_244Hz.build.timerconfig=TIMER_244Hz
mattairtech_mt_d21e.menu.timer.timer_183Hz=183.1Hz (16-bit)
mattairtech_mt_d21e.menu.timer.timer_183Hz.build.timerconfig=TIMER_183Hz
mattairtech_mt_d21e.menu.timer.timer_146Hz=146.5Hz (16-bit)
mattairtech_mt_d21e.menu.timer.timer_146Hz.build.timerconfig=TIMER_146Hz
mattairtech_mt_d21e.menu.timer.timer_122Hz=122.1Hz (16-bit)
mattairtech_mt_d21e.menu.timer.timer_122Hz.build.timerconfig=TIMER_122Hz
mattairtech_mt_d21e.menu.timer.timer_105Hz=104.6Hz (16-bit)
mattairtech_mt_d21e.menu.timer.timer_105Hz.build.timerconfig=TIMER_105Hz
mattairtech_mt_d21e.menu.timer.timer_81Hz=81.38Hz (16-bit)
mattairtech_mt_d21e.menu.timer.timer_81Hz.build.timerconfig=TIMER_81Hz
mattairtech_mt_d21e.menu.timer.timer_61Hz=61.04Hz (16-bit)
mattairtech_mt_d21e.menu.timer.timer_61Hz.build.timerconfig=TIMER_61Hz
mattairtech_mt_d21e.menu.timer.timer_31Hz=30.52Hz (16-bit)
mattairtech_mt_d21e.menu.timer.timer_31Hz.build.timerconfig=TIMER_31Hz
mattairtech_mt_d21e.menu.timer.timer_187500Hz=187500Hz (8-bit)
mattairtech_mt_d21e.menu.timer.timer_187500Hz.build.timerconfig=TIMER_187500Hz
mattairtech_mt_d21e.menu.timer.timer_93750Hz=93750Hz (8-bit)
mattairtech_mt_d21e.menu.timer.timer_93750Hz.build.timerconfig=TIMER_93750Hz
mattairtech_mt_d21e.menu.timer.timer_62500Hz=62500Hz (8-bit)
mattairtech_mt_d21e.menu.timer.timer_62500Hz.build.timerconfig=TIMER_62500Hz
mattairtech_mt_d21e.menu.timer.timer_37500Hz=37500Hz (8-bit)
mattairtech_mt_d21e.menu.timer.timer_37500Hz.build.timerconfig=TIMER_37500Hz
mattairtech_mt_d21e.menu.timer.timer_20833Hz=20833Hz (8-bit)
mattairtech_mt_d21e.menu.timer.timer_20833Hz.build.timerconfig=TIMER_20833Hz
mattairtech_mt_d21e.menu.timer.timer_12500Hz=12500Hz (8-bit)
mattairtech_mt_d21e.menu.timer.timer_12500Hz.build.timerconfig=TIMER_12500Hz
mattairtech_mt_d21e.menu.timer.timer_7500Hz=7500Hz (8-bit)
mattairtech_mt_d21e.menu.timer.timer_7500Hz.build.timerconfig=TIMER_7500Hz
mattairtech_mt_d21e.menu.timer.timer_4166Hz=4166Hz (8-bit)
mattairtech_mt_d21e.menu.timer.timer_4166Hz.build.timerconfig=TIMER_4166Hz
mattairtech_mt_d21e.menu.timer.timer_2930Hz=2930Hz (8-bit)
mattairtech_mt_d21e.menu.timer.timer_2930Hz.build.timerconfig=TIMER_2930Hz
mattairtech_mt_d21e.menu.timer.timer_1465Hz=1465Hz (8-bit, 16-bit for D51)
mattairtech_mt_d21e.menu.timer.timer_1465Hz.build.timerconfig=TIMER_1465Hz
mattairtech_mt_d21e.menu.cpu.samd21e18a=SAMD21E18A
mattairtech_mt_d21e.menu.cpu.samd21e18a.upload.maximum_size=253952
mattairtech_mt_d21e.menu.cpu.samd21e18a.build.extra_flags=-D__SAMD21E18A__ {build.usb_flags} -DARM_MATH_CM0PLUS
mattairtech_mt_d21e.menu.cpu.samd21e18a.build.ldscript=flash_256KB.ld
mattairtech_mt_d21e.menu.cpu.samd21e18a.build.openocdscript=openocd_scripts/SAMD21E18A.cfg
mattairtech_mt_d21e.menu.cpu.samd21e18a.bootloader.file=zero/binaries/sam_ba_MT_D21E_rev_A_SAMD21E18A.bin
mattairtech_mt_d21e.menu.cpu.samd21e17a=SAMD21E17A
mattairtech_mt_d21e.menu.cpu.samd21e17a.upload.maximum_size=122880
mattairtech_mt_d21e.menu.cpu.samd21e17a.build.extra_flags=-D__SAMD21E17A__ {build.usb_flags} -DARM_MATH_CM0PLUS
mattairtech_mt_d21e.menu.cpu.samd21e17a.build.ldscript=flash_128KB.ld
mattairtech_mt_d21e.menu.cpu.samd21e17a.build.openocdscript=openocd_scripts/SAMD21E17A.cfg
mattairtech_mt_d21e.menu.cpu.samd21e17a.bootloader.file=zero/binaries/sam_ba_MT_D21E_rev_A_SAMD21E17A.bin
mattairtech_mt_d21e.menu.cpu.samd21e16a=SAMD21E16A
mattairtech_mt_d21e.menu.cpu.samd21e16a.upload.maximum_size=57344
mattairtech_mt_d21e.menu.cpu.samd21e16a.build.extra_flags=-D__SAMD21E16A__ {build.usb_flags} -DARM_MATH_CM0PLUS
mattairtech_mt_d21e.menu.cpu.samd21e16a.build.ldscript=flash_64KB.ld
mattairtech_mt_d21e.menu.cpu.samd21e16a.build.openocdscript=openocd_scripts/SAMD21E16A.cfg
mattairtech_mt_d21e.menu.cpu.samd21e16a.bootloader.file=zero/binaries/sam_ba_MT_D21E_rev_A_SAMD21E16A.bin
mattairtech_mt_d21e.menu.cpu.samd21e15a=SAMD21E15A
mattairtech_mt_d21e.menu.cpu.samd21e15a.upload.maximum_size=24576
mattairtech_mt_d21e.menu.cpu.samd21e15a.build.extra_flags=-D__SAMD21E15A__ {build.usb_flags} -DARM_MATH_CM0PLUS
mattairtech_mt_d21e.menu.cpu.samd21e15a.build.ldscript=flash_32KB.ld
mattairtech_mt_d21e.menu.cpu.samd21e15a.build.openocdscript=openocd_scripts/SAMD21E15A.cfg
mattairtech_mt_d21e.menu.cpu.samd21e15a.bootloader.file=zero/binaries/sam_ba_MT_D21E_rev_A_SAMD21E15A.bin
mattairtech_mt_d21e.menu.bootloader.8kb=8KB_BOOTLOADER
mattairtech_mt_d21e.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
mattairtech_mt_d21e.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
mattairtech_mt_d21e.menu.bootloader.8kb.upload.tool=MattairTech_Arduino:bossac
mattairtech_mt_d21e.menu.bootloader.8kb.upload.use_1200bps_touch=true
mattairtech_mt_d21e.menu.bootloader.8kb.upload.wait_for_upload_port=true
mattairtech_mt_d21e.menu.bootloader.8kb.upload.native_usb=true
mattairtech_mt_d21e.menu.bootloader.16kb=16KB_BOOTLOADER
mattairtech_mt_d21e.menu.bootloader.16kb.build.bootloader_size=__16KB_BOOTLOADER__
mattairtech_mt_d21e.menu.bootloader.16kb.build.ldscript_path=linker_scripts/gcc/16KB_Bootloader
mattairtech_mt_d21e.menu.bootloader.16kb.upload.tool=MattairTech_Arduino:bossac
mattairtech_mt_d21e.menu.bootloader.16kb.upload.use_1200bps_touch=true
mattairtech_mt_d21e.menu.bootloader.16kb.upload.wait_for_upload_port=true
mattairtech_mt_d21e.menu.bootloader.16kb.upload.native_usb=true
mattairtech_mt_d21e.menu.bootloader.0kb=NO_BOOTLOADER
mattairtech_mt_d21e.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
mattairtech_mt_d21e.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
mattairtech_mt_d21e.menu.bootloader.0kb.upload.tool=arduino:openocd
mattairtech_mt_d21e.menu.bootloader.0kb.upload.use_1200bps_touch=false
mattairtech_mt_d21e.menu.bootloader.0kb.upload.wait_for_upload_port=false
mattairtech_mt_d21e.menu.bootloader.0kb.upload.native_usb=false
mattairtech_mt_d21e.menu.serial.one_uart=ONE_UART_ONE_WIRE_ONE_SPI
mattairtech_mt_d21e.menu.serial.one_uart.build.serialcom_uart=ONE_UART
mattairtech_mt_d21e.menu.serial.one_uart.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d21e.menu.serial.one_uart.build.serialcom_spi=ONE_SPI
mattairtech_mt_d21e.menu.serial.one_uart_one_wire_two_spi=ONE_UART_ONE_WIRE_TWO_SPI
mattairtech_mt_d21e.menu.serial.one_uart_one_wire_two_spi.build.serialcom_uart=ONE_UART
mattairtech_mt_d21e.menu.serial.one_uart_one_wire_two_spi.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d21e.menu.serial.one_uart_one_wire_two_spi.build.serialcom_spi=TWO_SPI
mattairtech_mt_d21e.menu.serial.one_uart_two_wire_one_spi=ONE_UART_TWO_WIRE_ONE_SPI
mattairtech_mt_d21e.menu.serial.one_uart_two_wire_one_spi.build.serialcom_uart=ONE_UART
mattairtech_mt_d21e.menu.serial.one_uart_two_wire_one_spi.build.serialcom_wire=TWO_WIRE
mattairtech_mt_d21e.menu.serial.one_uart_two_wire_one_spi.build.serialcom_spi=ONE_SPI
mattairtech_mt_d21e.menu.serial.two_uart=TWO_UART_ONE_WIRE_ONE_SPI
mattairtech_mt_d21e.menu.serial.two_uart.build.serialcom_uart=TWO_UART
mattairtech_mt_d21e.menu.serial.two_uart.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d21e.menu.serial.two_uart.build.serialcom_spi=ONE_SPI
mattairtech_mt_d21e.menu.serial.three_uart_one_wire_no_spi=THREE_UART_ONE_WIRE_NO_SPI
mattairtech_mt_d21e.menu.serial.three_uart_one_wire_no_spi.build.serialcom_uart=THREE_UART
mattairtech_mt_d21e.menu.serial.three_uart_one_wire_no_spi.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d21e.menu.serial.three_uart_one_wire_no_spi.build.serialcom_spi=NO_SPI
mattairtech_mt_d21e.menu.serial.three_uart_no_wire_one_spi=THREE_UART_NO_WIRE_ONE_SPI
mattairtech_mt_d21e.menu.serial.three_uart_no_wire_one_spi.build.serialcom_uart=THREE_UART
mattairtech_mt_d21e.menu.serial.three_uart_no_wire_one_spi.build.serialcom_wire=NO_WIRE
mattairtech_mt_d21e.menu.serial.three_uart_no_wire_one_spi.build.serialcom_spi=ONE_SPI
mattairtech_mt_d21e.menu.serial.four_uart=FOUR_UART_NO_WIRE_NO_SPI
mattairtech_mt_d21e.menu.serial.four_uart.build.serialcom_uart=FOUR_UART
mattairtech_mt_d21e.menu.serial.four_uart.build.serialcom_wire=NO_WIRE
mattairtech_mt_d21e.menu.serial.four_uart.build.serialcom_spi=NO_SPI
mattairtech_mt_d21e.menu.serial.no_uart_one_wire_two_spi=NO_UART_ONE_WIRE_TWO_SPI
mattairtech_mt_d21e.menu.serial.no_uart_one_wire_two_spi.build.serialcom_uart=NO_UART
mattairtech_mt_d21e.menu.serial.no_uart_one_wire_two_spi.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d21e.menu.serial.no_uart_one_wire_two_spi.build.serialcom_spi=TWO_SPI
mattairtech_mt_d21e.menu.usb.cdc=CDC_ONLY
mattairtech_mt_d21e.menu.usb.cdc.build.usbcom=CDC_ONLY
mattairtech_mt_d21e.menu.usb.cdc.build.pid=0x0557
mattairtech_mt_d21e.menu.usb.cdc_hid=CDC_HID
mattairtech_mt_d21e.menu.usb.cdc_hid.build.usbcom=CDC_HID
mattairtech_mt_d21e.menu.usb.cdc_hid.build.pid=0x0856
mattairtech_mt_d21e.menu.usb.withcdc=WITH_CDC
mattairtech_mt_d21e.menu.usb.withcdc.build.usbcom=WITH_CDC
mattairtech_mt_d21e.menu.usb.withcdc.build.pid=0x0B41
mattairtech_mt_d21e.menu.usb.hid=HID_ONLY
mattairtech_mt_d21e.menu.usb.hid.build.usbcom=HID_ONLY
mattairtech_mt_d21e.menu.usb.hid.build.pid=0x0B40
mattairtech_mt_d21e.menu.usb.nocdc=WITHOUT_CDC
mattairtech_mt_d21e.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
mattairtech_mt_d21e.menu.usb.nocdc.build.pid=0x0A0C
mattairtech_mt_d21e.menu.usb.none=USB_DISABLED
mattairtech_mt_d21e.menu.usb.none.build.usbcom=USB_DISABLED
mattairtech_mt_d21e.menu.usb.none.build.pid=0x0856


