arduino/ArduinoCore-samd/boards.txt
# MattairTech MT-D11 (D11D14AM, QFN-24)
mattairtech_mt_d11.name=MattairTech MT-D11
mattairtech_mt_d11.vid.0=0x16D0
mattairtech_mt_d11.pid.0=0x0557
mattairtech_mt_d11.vid.1=0x16D0
mattairtech_mt_d11.pid.1=0x0856
mattairtech_mt_d11.vid.2=0x16D0
mattairtech_mt_d11.pid.2=0x0B41
mattairtech_mt_d11.vid.3=0x16D0
mattairtech_mt_d11.pid.3=0x0B40
mattairtech_mt_d11.vid.4=0x16D0
mattairtech_mt_d11.pid.4=0x0A0C
mattairtech_mt_d11.vid.5=0x16D0
mattairtech_mt_d11.pid.5=0x0856
mattairtech_mt_d11.build.mcu=cortex-m0plus
mattairtech_mt_d11.build.mathlib=arm_cortexM0l_math
mattairtech_mt_d11.build.f_cpu=48000000L
mattairtech_mt_d11.build.usb_product="MT-D11"
mattairtech_mt_d11.build.usb_manufacturer="MattairTech LLC"
mattairtech_mt_d11.build.board=SAMD_ZERO
mattairtech_mt_d11.build.core=arduino
mattairtech_mt_d11.build.variant=MT_D11
mattairtech_mt_d11.build.variant_system_lib=
mattairtech_mt_d11.build.vid=0x16D0
mattairtech_mt_d11.upload.protocol=sam-ba
mattairtech_mt_d11.bootloader.tool=arduino:openocd
mattairtech_mt_d11.menu.float.default=Print & String use auto-promoted doubles only
mattairtech_mt_d11.menu.float.default.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
mattairtech_mt_d11.menu.float.print=Print uses separate singles and doubles
mattairtech_mt_d11.menu.float.print.build.floatconfig=FLOAT_PRINT_SINGLES_DOUBLES
mattairtech_mt_d11.menu.float.string=String uses separate singles and doubles
mattairtech_mt_d11.menu.float.string.build.floatconfig=FLOAT_STRING_SINGLES_DOUBLES
mattairtech_mt_d11.menu.float.both=Print & String use separate singles and doubles
mattairtech_mt_d11.menu.float.both.build.floatconfig=FLOAT_BOTH_SINGLES_DOUBLES
mattairtech_mt_d11.menu.config.disabled=config.h disabled
mattairtech_mt_d11.menu.config.disabled.build.buildconfig=CONFIG_H_DISABLED
mattairtech_mt_d11.menu.config.enabled=config.h enabled (mostly code size reductions)
mattairtech_mt_d11.menu.config.enabled.build.buildconfig=CONFIG_H_ENABLED
mattairtech_mt_d11.menu.clock.crystal_32k=32KHZ_CRYSTAL
mattairtech_mt_d11.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
mattairtech_mt_d11.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
mattairtech_mt_d11.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
mattairtech_mt_d11.menu.clock.internal=INTERNAL_OSCILLATOR
mattairtech_mt_d11.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
mattairtech_mt_d11.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
mattairtech_mt_d11.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
mattairtech_mt_d11.menu.timer.timer_732Hz=732.4Hz (16-bit)
mattairtech_mt_d11.menu.timer.timer_732Hz.build.timerconfig=TIMER_732Hz
mattairtech_mt_d11.menu.timer.timer_366Hz=366.2Hz (16-bit)
mattairtech_mt_d11.menu.timer.timer_366Hz.build.timerconfig=TIMER_366Hz
mattairtech_mt_d11.menu.timer.timer_244Hz=244.1Hz (16-bit)
mattairtech_mt_d11.menu.timer.timer_244Hz.build.timerconfig=TIMER_244Hz
mattairtech_mt_d11.menu.timer.timer_183Hz=183.1Hz (16-bit)
mattairtech_mt_d11.menu.timer.timer_183Hz.build.timerconfig=TIMER_183Hz
mattairtech_mt_d11.menu.timer.timer_146Hz=146.5Hz (16-bit)
mattairtech_mt_d11.menu.timer.timer_146Hz.build.timerconfig=TIMER_146Hz
mattairtech_mt_d11.menu.timer.timer_122Hz=122.1Hz (16-bit)
mattairtech_mt_d11.menu.timer.timer_122Hz.build.timerconfig=TIMER_122Hz
mattairtech_mt_d11.menu.timer.timer_105Hz=104.6Hz (16-bit)
mattairtech_mt_d11.menu.timer.timer_105Hz.build.timerconfig=TIMER_105Hz
mattairtech_mt_d11.menu.timer.timer_81Hz=81.38Hz (16-bit)
mattairtech_mt_d11.menu.timer.timer_81Hz.build.timerconfig=TIMER_81Hz
mattairtech_mt_d11.menu.timer.timer_61Hz=61.04Hz (16-bit)
mattairtech_mt_d11.menu.timer.timer_61Hz.build.timerconfig=TIMER_61Hz
mattairtech_mt_d11.menu.timer.timer_31Hz=30.52Hz (16-bit)
mattairtech_mt_d11.menu.timer.timer_31Hz.build.timerconfig=TIMER_31Hz
mattairtech_mt_d11.menu.timer.timer_187500Hz=187500Hz (8-bit)
mattairtech_mt_d11.menu.timer.timer_187500Hz.build.timerconfig=TIMER_187500Hz
mattairtech_mt_d11.menu.timer.timer_93750Hz=93750Hz (8-bit)
mattairtech_mt_d11.menu.timer.timer_93750Hz.build.timerconfig=TIMER_93750Hz
mattairtech_mt_d11.menu.timer.timer_62500Hz=62500Hz (8-bit)
mattairtech_mt_d11.menu.timer.timer_62500Hz.build.timerconfig=TIMER_62500Hz
mattairtech_mt_d11.menu.timer.timer_37500Hz=37500Hz (8-bit)
mattairtech_mt_d11.menu.timer.timer_37500Hz.build.timerconfig=TIMER_37500Hz
mattairtech_mt_d11.menu.timer.timer_20833Hz=20833Hz (8-bit)
mattairtech_mt_d11.menu.timer.timer_20833Hz.build.timerconfig=TIMER_20833Hz
mattairtech_mt_d11.menu.timer.timer_12500Hz=12500Hz (8-bit)
mattairtech_mt_d11.menu.timer.timer_12500Hz.build.timerconfig=TIMER_12500Hz
mattairtech_mt_d11.menu.timer.timer_7500Hz=7500Hz (8-bit)
mattairtech_mt_d11.menu.timer.timer_7500Hz.build.timerconfig=TIMER_7500Hz
mattairtech_mt_d11.menu.timer.timer_4166Hz=4166Hz (8-bit)
mattairtech_mt_d11.menu.timer.timer_4166Hz.build.timerconfig=TIMER_4166Hz
mattairtech_mt_d11.menu.timer.timer_2930Hz=2930Hz (8-bit)
mattairtech_mt_d11.menu.timer.timer_2930Hz.build.timerconfig=TIMER_2930Hz
mattairtech_mt_d11.menu.timer.timer_1465Hz=1465Hz (8-bit, 16-bit for D51)
mattairtech_mt_d11.menu.timer.timer_1465Hz.build.timerconfig=TIMER_1465Hz
mattairtech_mt_d11.build.extra_flags=-D__SAMD11D14AM__ {build.usb_flags} -DARM_MATH_CM0PLUS
mattairtech_mt_d11.build.ldscript=flash_16KB.ld
mattairtech_mt_d11.build.openocdscript=openocd_scripts/SAMD11D14AM.cfg
mattairtech_mt_d11.bootloader.file=zero/binaries/sam_ba_MT_D11_SAMD11D14AM.bin
mattairtech_mt_d11.menu.bootloader.4kb=4KB_BOOTLOADER
mattairtech_mt_d11.menu.bootloader.4kb.build.bootloader_size=__4KB_BOOTLOADER__
mattairtech_mt_d11.menu.bootloader.4kb.build.ldscript_path=linker_scripts/gcc/4KB_Bootloader
mattairtech_mt_d11.menu.bootloader.4kb.upload.tool=MattairTech_Arduino:bossac
mattairtech_mt_d11.menu.bootloader.4kb.upload.use_1200bps_touch=true
mattairtech_mt_d11.menu.bootloader.4kb.upload.wait_for_upload_port=true
mattairtech_mt_d11.menu.bootloader.4kb.upload.native_usb=true
mattairtech_mt_d11.menu.bootloader.4kb.upload.maximum_size=12288
mattairtech_mt_d11.menu.bootloader.0kb=NO_BOOTLOADER
mattairtech_mt_d11.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
mattairtech_mt_d11.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
mattairtech_mt_d11.menu.bootloader.0kb.upload.tool=arduino:openocd
mattairtech_mt_d11.menu.bootloader.0kb.upload.use_1200bps_touch=false
mattairtech_mt_d11.menu.bootloader.0kb.upload.wait_for_upload_port=false
mattairtech_mt_d11.menu.bootloader.0kb.upload.native_usb=false
mattairtech_mt_d11.menu.bootloader.0kb.upload.maximum_size=16384
mattairtech_mt_d11.menu.serial.one_uart=ONE_UART_ONE_WIRE_ONE_SPI
mattairtech_mt_d11.menu.serial.one_uart.build.serialcom_uart=ONE_UART
mattairtech_mt_d11.menu.serial.one_uart.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d11.menu.serial.one_uart.build.serialcom_spi=ONE_SPI
mattairtech_mt_d11.menu.serial.no_uart=NO_UART_ONE_WIRE_ONE_SPI
mattairtech_mt_d11.menu.serial.no_uart.build.serialcom_uart=NO_UART
mattairtech_mt_d11.menu.serial.no_uart.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d11.menu.serial.no_uart.build.serialcom_spi=ONE_SPI
mattairtech_mt_d11.menu.serial.two_uart=TWO_UART_ONE_WIRE_NO_SPI
mattairtech_mt_d11.menu.serial.two_uart.build.serialcom_uart=TWO_UART
mattairtech_mt_d11.menu.serial.two_uart.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d11.menu.serial.two_uart.build.serialcom_spi=NO_SPI
mattairtech_mt_d11.menu.usb.cdc=CDC_ONLY
mattairtech_mt_d11.menu.usb.cdc.build.usbcom=CDC_ONLY
mattairtech_mt_d11.menu.usb.cdc.build.pid=0x0557
mattairtech_mt_d11.menu.usb.cdc_hid=CDC_HID
mattairtech_mt_d11.menu.usb.cdc_hid.build.usbcom=CDC_HID
mattairtech_mt_d11.menu.usb.cdc_hid.build.pid=0x0856
mattairtech_mt_d11.menu.usb.withcdc=WITH_CDC
mattairtech_mt_d11.menu.usb.withcdc.build.usbcom=WITH_CDC
mattairtech_mt_d11.menu.usb.withcdc.build.pid=0x0B41
mattairtech_mt_d11.menu.usb.hid=HID_ONLY
mattairtech_mt_d11.menu.usb.hid.build.usbcom=HID_ONLY
mattairtech_mt_d11.menu.usb.hid.build.pid=0x0B40
mattairtech_mt_d11.menu.usb.nocdc=WITHOUT_CDC
mattairtech_mt_d11.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
mattairtech_mt_d11.menu.usb.nocdc.build.pid=0x0A0C
mattairtech_mt_d11.menu.usb.none=USB_DISABLED
mattairtech_mt_d11.menu.usb.none.build.usbcom=USB_DISABLED
mattairtech_mt_d11.menu.usb.none.build.pid=0x0856


# Generic D11C14A (SOIC-14)
d11c14a.name=Generic D11C14A
d11c14a.vid.0=0x16D0
d11c14a.pid.0=0x0557
d11c14a.vid.1=0x16D0
d11c14a.pid.1=0x0856
d11c14a.vid.2=0x16D0
d11c14a.pid.2=0x0B41
d11c14a.vid.3=0x16D0
d11c14a.pid.3=0x0B40
d11c14a.vid.4=0x16D0
d11c14a.pid.4=0x0A0C
d11c14a.vid.5=0x16D0
d11c14a.pid.5=0x0856
d11c14a.build.mcu=cortex-m0plus
d11c14a.build.mathlib=arm_cortexM0l_math
d11c14a.build.f_cpu=48000000L
d11c14a.build.usb_product="D11C14A"
d11c14a.build.usb_manufacturer="MattairTech LLC"
d11c14a.build.board=SAMD_ZERO
d11c14a.build.core=arduino
d11c14a.build.variant=Generic_D11C14A
d11c14a.build.variant_system_lib=
d11c14a.build.vid=0x16D0
d11c14a.upload.protocol=sam-ba
d11c14a.bootloader.tool=arduino:openocd
d11c14a.menu.float.default=Print & String use auto-promoted doubles only
d11c14a.menu.float.default.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
d11c14a.menu.float.print=Print uses separate singles and doubles
d11c14a.menu.float.print.build.floatconfig=FLOAT_PRINT_SINGLES_DOUBLES
d11c14a.menu.float.string=String uses separate singles and doubles
d11c14a.menu.float.string.build.floatconfig=FLOAT_STRING_SINGLES_DOUBLES
d11c14a.menu.float.both=Print & String use separate singles and doubles
d11c14a.menu.float.both.build.floatconfig=FLOAT_BOTH_SINGLES_DOUBLES
d11c14a.menu.config.disabled=config.h disabled
d11c14a.menu.config.disabled.build.buildconfig=CONFIG_H_DISABLED
d11c14a.menu.config.enabled=config.h enabled (mostly code size reductions)
d11c14a.menu.config.enabled.build.buildconfig=CONFIG_H_ENABLED
d11c14a.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
d11c14a.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
d11c14a.menu.clock.internal=INTERNAL_OSCILLATOR
d11c14a.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
d11c14a.menu.clock.crystal_32k=32KHZ_CRYSTAL
d11c14a.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
d11c14a.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
d11c14a.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
d11c14a.menu.timer.timer_732Hz=732.4Hz (16-bit)
d11c14a.menu.timer.timer_732Hz.build.timerconfig=TIMER_732Hz
d11c14a.menu.timer.timer_366Hz=366.2Hz (16-bit)
d11c14a.menu.timer.timer_366Hz.build.timerconfig=TIMER_366Hz
d11c14a.menu.timer.timer_244Hz=244.1Hz (16-bit)
d11c14a.menu.timer.timer_244Hz.build.timerconfig=TIMER_244Hz
d11c14a.menu.timer.timer_183Hz=183.1Hz (16-bit)
d11c14a.menu.timer.timer_183Hz.build.timerconfig=TIMER_183Hz
d11c14a.menu.timer.timer_146Hz=146.5Hz (16-bit)
d11c14a.menu.timer.timer_146Hz.build.timerconfig=TIMER_146Hz
d11c14a.menu.timer.timer_122Hz=122.1Hz (16-bit)
d11c14a.menu.timer.timer_122Hz.build.timerconfig=TIMER_122Hz
d11c14a.menu.timer.timer_105Hz=104.6Hz (16-bit)
d11c14a.menu.timer.timer_105Hz.build.timerconfig=TIMER_105Hz
d11c14a.menu.timer.timer_81Hz=81.38Hz (16-bit)
d11c14a.menu.timer.timer_81Hz.build.timerconfig=TIMER_81Hz
d11c14a.menu.timer.timer_61Hz=61.04Hz (16-bit)
d11c14a.menu.timer.timer_61Hz.build.timerconfig=TIMER_61Hz
d11c14a.menu.timer.timer_31Hz=30.52Hz (16-bit)
d11c14a.menu.timer.timer_31Hz.build.timerconfig=TIMER_31Hz
d11c14a.menu.timer.timer_187500Hz=187500Hz (8-bit)
d11c14a.menu.timer.timer_187500Hz.build.timerconfig=TIMER_187500Hz
d11c14a.menu.timer.timer_93750Hz=93750Hz (8-bit)
d11c14a.menu.timer.timer_93750Hz.build.timerconfig=TIMER_93750Hz
d11c14a.menu.timer.timer_62500Hz=62500Hz (8-bit)
d11c14a.menu.timer.timer_62500Hz.build.timerconfig=TIMER_62500Hz
d11c14a.menu.timer.timer_37500Hz=37500Hz (8-bit)
d11c14a.menu.timer.timer_37500Hz.build.timerconfig=TIMER_37500Hz
d11c14a.menu.timer.timer_20833Hz=20833Hz (8-bit)
d11c14a.menu.timer.timer_20833Hz.build.timerconfig=TIMER_20833Hz
d11c14a.menu.timer.timer_12500Hz=12500Hz (8-bit)
d11c14a.menu.timer.timer_12500Hz.build.timerconfig=TIMER_12500Hz
d11c14a.menu.timer.timer_7500Hz=7500Hz (8-bit)
d11c14a.menu.timer.timer_7500Hz.build.timerconfig=TIMER_7500Hz
d11c14a.menu.timer.timer_4166Hz=4166Hz (8-bit)
d11c14a.menu.timer.timer_4166Hz.build.timerconfig=TIMER_4166Hz
d11c14a.menu.timer.timer_2930Hz=2930Hz (8-bit)
d11c14a.menu.timer.timer_2930Hz.build.timerconfig=TIMER_2930Hz
d11c14a.menu.timer.timer_1465Hz=1465Hz (8-bit, 16-bit for D51)
d11c14a.menu.timer.timer_1465Hz.build.timerconfig=TIMER_1465Hz
d11c14a.build.extra_flags=-D__SAMD11C14A__ {build.usb_flags} -DARM_MATH_CM0PLUS
d11c14a.build.ldscript=flash_16KB.ld
d11c14a.build.openocdscript=openocd_scripts/SAMD11C14A.cfg
d11c14a.bootloader.file=zero/binaries/sam_ba_Generic_D11C14A_SAMD11C14A.bin
d11c14a.menu.bootloader.4kb=4KB_BOOTLOADER
d11c14a.menu.bootloader.4kb.build.bootloader_size=__4KB_BOOTLOADER__
d11c14a.menu.bootloader.4kb.build.ldscript_path=linker_scripts/gcc/4KB_Bootloader
d11c14a.menu.bootloader.4kb.upload.tool=MattairTech_Arduino:bossac
d11c14a.menu.bootloader.4kb.upload.use_1200bps_touch=true
d11c14a.menu.bootloader.4kb.upload.wait_for_upload_port=true
d11c14a.menu.bootloader.4kb.upload.native_usb=true
d11c14a.menu.bootloader.4kb.upload.maximum_size=12288
d11c14a.menu.bootloader.0kb=NO_BOOTLOADER
d11c14a.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
d11c14a.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
d11c14a.menu.bootloader.0kb.upload.tool=arduino:openocd
d11c14a.menu.bootloader.0kb.upload.use_1200bps_touch=false
d11c14a.menu.bootloader.0kb.upload.wait_for_upload_port=false
d11c14a.menu.bootloader.0kb.upload.native_usb=false
d11c14a.menu.bootloader.0kb.upload.maximum_size=16384
d11c14a.menu.serial.one_uart=ONE_UART_ONE_WIRE_NO_SPI
d11c14a.menu.serial.one_uart.build.serialcom_uart=ONE_UART
d11c14a.menu.serial.one_uart.build.serialcom_wire=ONE_WIRE
d11c14a.menu.serial.one_uart.build.serialcom_spi=NO_SPI
d11c14a.menu.serial.two_uart=TWO_UART_NO_WIRE_NO_SPI
d11c14a.menu.serial.two_uart.build.serialcom_uart=TWO_UART
d11c14a.menu.serial.two_uart.build.serialcom_wire=NO_WIRE
d11c14a.menu.serial.two_uart.build.serialcom_spi=NO_SPI
d11c14a.menu.serial.one_uart_no_wire_one_spi=ONE_UART_NO_WIRE_ONE_SPI
d11c14a.menu.serial.one_uart_no_wire_one_spi.build.serialcom_uart=ONE_UART
d11c14a.menu.serial.one_uart_no_wire_one_spi.build.serialcom_wire=NO_WIRE
d11c14a.menu.serial.one_uart_no_wire_one_spi.build.serialcom_spi=ONE_SPI
d11c14a.menu.serial.no_uart=NO_UART_ONE_WIRE_ONE_SPI
d11c14a.menu.serial.no_uart.build.serialcom_uart=NO_UART
d11c14a.menu.serial.no_uart.build.serialcom_wire=ONE_WIRE
d11c14a.menu.serial.no_uart.build.serialcom_spi=ONE_SPI
d11c14a.menu.usb.cdc=CDC_ONLY
d11c14a.menu.usb.cdc.build.usbcom=CDC_ONLY
d11c14a.menu.usb.cdc.build.pid=0x0557
d11c14a.menu.usb.cdc_hid=CDC_HID
d11c14a.menu.usb.cdc_hid.build.usbcom=CDC_HID
d11c14a.menu.usb.cdc_hid.build.pid=0x0856
d11c14a.menu.usb.withcdc=WITH_CDC
d11c14a.menu.usb.withcdc.build.usbcom=WITH_CDC
d11c14a.menu.usb.withcdc.build.pid=0x0B41
d11c14a.menu.usb.hid=HID_ONLY
d11c14a.menu.usb.hid.build.usbcom=HID_ONLY
d11c14a.menu.usb.hid.build.pid=0x0B40
d11c14a.menu.usb.nocdc=WITHOUT_CDC
d11c14a.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
d11c14a.menu.usb.nocdc.build.pid=0x0A0C
d11c14a.menu.usb.none=USB_DISABLED
d11c14a.menu.usb.none.build.usbcom=USB_DISABLED
d11c14a.menu.usb.none.build.pid=0x0856


