arduino/ArduinoCore-samd/boards.txt
# MattairTech Core for Arduino M0 / M0 Pro (Autodetect Port)
mzero.name=Arduino M0 / M0 Pro (Autodetect Port)
mzero.bootloader.file=zero/binaries/sam_ba_arduino_m0_pro_SAMD21G18A.bin
# M0 Pro (Programming port)
mzero.vid.0=0x03eb
mzero.pid.0=0x2111
mzero.vid.0.upload.tool=arduino:openocd
mzero.vid.0.upload.use_1200bps_touch=false
mzero.vid.0.upload.wait_for_upload_port=false
mzero.vid.0.upload.native_usb=false
# M0 Pro (Native Port)
mzero.vid.1=0x2a03
mzero.pid.1=0x004d
mzero.vid.2=0x2a03
mzero.pid.2=0x804d
mzero.vid.3=0x2a03
mzero.pid.3=0x004f
mzero.vid.4=0x2a03
mzero.pid.4=0x804f
mzero.build.vid=0x2a03
mzero.build.pid=0x804f
# M0
mzero.vid.5=0x2a03
mzero.pid.5=0x004e
mzero.vid.5.build.vid=0x2a03
mzero.vid.5.build.pid=0x804e
mzero.vid.5.bootloader.file=zero/binaries/sam_ba_arduino_m0_SAMD21G18A.bin
mzero.vid.6=0x2a03
mzero.pid.6=0x804e
mzero.vid.6.build.vid=0x2a03
mzero.vid.6.build.pid=0x804e
mzero.vid.6.bootloader.file=zero/binaries/sam_ba_arduino_m0_SAMD21G18A.bin
mzero.upload.tool=MattairTech_Arduino:bossac
mzero.upload.protocol=sam-ba
mzero.upload.use_1200bps_touch=true
mzero.upload.wait_for_upload_port=true
mzero.upload.native_usb=true
mzero.build.mcu=cortex-m0plus
mzero.build.mathlib=arm_cortexM0l_math
mzero.build.f_cpu=48000000L
mzero.build.usb_product="Arduino M0 / M0 Pro"
mzero.build.board=SAM_ZERO
mzero.build.core=arduino
mzero.build.variant=arduino_mzero
mzero.build.variant_system_lib=
mzero.menu.float.default=Print & String use auto-promoted doubles only
mzero.menu.float.default.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
mzero.menu.float.print=Print uses separate singles and doubles
mzero.menu.float.print.build.floatconfig=FLOAT_PRINT_SINGLES_DOUBLES
mzero.menu.float.string=String uses separate singles and doubles
mzero.menu.float.string.build.floatconfig=FLOAT_STRING_SINGLES_DOUBLES
mzero.menu.float.both=Print & String use separate singles and doubles
mzero.menu.float.both.build.floatconfig=FLOAT_BOTH_SINGLES_DOUBLES
mzero.menu.config.disabled=config.h disabled
mzero.menu.config.disabled.build.buildconfig=CONFIG_H_DISABLED
mzero.menu.config.enabled=config.h enabled (mostly code size reductions)
mzero.menu.config.enabled.build.buildconfig=CONFIG_H_ENABLED
mzero.menu.clock.crystal_32k=32KHZ_CRYSTAL
mzero.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
mzero.menu.clock.internal=INTERNAL_OSCILLATOR
mzero.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
mzero.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
mzero.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
mzero.menu.timer.timer_732Hz=732.4Hz (16-bit)
mzero.menu.timer.timer_732Hz.build.timerconfig=TIMER_732Hz
mzero.menu.timer.timer_366Hz=366.2Hz (16-bit)
mzero.menu.timer.timer_366Hz.build.timerconfig=TIMER_366Hz
mzero.menu.timer.timer_244Hz=244.1Hz (16-bit)
mzero.menu.timer.timer_244Hz.build.timerconfig=TIMER_244Hz
mzero.menu.timer.timer_183Hz=183.1Hz (16-bit)
mzero.menu.timer.timer_183Hz.build.timerconfig=TIMER_183Hz
mzero.menu.timer.timer_146Hz=146.5Hz (16-bit)
mzero.menu.timer.timer_146Hz.build.timerconfig=TIMER_146Hz
mzero.menu.timer.timer_122Hz=122.1Hz (16-bit)
mzero.menu.timer.timer_122Hz.build.timerconfig=TIMER_122Hz
mzero.menu.timer.timer_105Hz=104.6Hz (16-bit)
mzero.menu.timer.timer_105Hz.build.timerconfig=TIMER_105Hz
mzero.menu.timer.timer_81Hz=81.38Hz (16-bit)
mzero.menu.timer.timer_81Hz.build.timerconfig=TIMER_81Hz
mzero.menu.timer.timer_61Hz=61.04Hz (16-bit)
mzero.menu.timer.timer_61Hz.build.timerconfig=TIMER_61Hz
mzero.menu.timer.timer_31Hz=30.52Hz (16-bit)
mzero.menu.timer.timer_31Hz.build.timerconfig=TIMER_31Hz
mzero.menu.timer.timer_187500Hz=187500Hz (8-bit)
mzero.menu.timer.timer_187500Hz.build.timerconfig=TIMER_187500Hz
mzero.menu.timer.timer_93750Hz=93750Hz (8-bit)
mzero.menu.timer.timer_93750Hz.build.timerconfig=TIMER_93750Hz
mzero.menu.timer.timer_62500Hz=62500Hz (8-bit)
mzero.menu.timer.timer_62500Hz.build.timerconfig=TIMER_62500Hz
mzero.menu.timer.timer_37500Hz=37500Hz (8-bit)
mzero.menu.timer.timer_37500Hz.build.timerconfig=TIMER_37500Hz
mzero.menu.timer.timer_20833Hz=20833Hz (8-bit)
mzero.menu.timer.timer_20833Hz.build.timerconfig=TIMER_20833Hz
mzero.menu.timer.timer_12500Hz=12500Hz (8-bit)
mzero.menu.timer.timer_12500Hz.build.timerconfig=TIMER_12500Hz
mzero.menu.timer.timer_7500Hz=7500Hz (8-bit)
mzero.menu.timer.timer_7500Hz.build.timerconfig=TIMER_7500Hz
mzero.menu.timer.timer_4166Hz=4166Hz (8-bit)
mzero.menu.timer.timer_4166Hz.build.timerconfig=TIMER_4166Hz
mzero.menu.timer.timer_2930Hz=2930Hz (8-bit)
mzero.menu.timer.timer_2930Hz.build.timerconfig=TIMER_2930Hz
mzero.menu.timer.timer_1465Hz=1465Hz (8-bit, 16-bit for D51)
mzero.menu.timer.timer_1465Hz.build.timerconfig=TIMER_1465Hz
mzero.build.extra_flags=-D__SAMD21G18A__ -mthumb {build.usb_flags} -DARM_MATH_CM0PLUS
mzero.build.ldscript=flash_256KB.ld
mzero.build.openocdscript=openocd_scripts/SAMD21G18A.cfg
mzero.bootloader.tool=arduino:openocd
mzero.menu.bootloader.16kb=16KB_BOOTLOADER
mzero.menu.bootloader.16kb.build.bootloader_size=__16KB_BOOTLOADER__
mzero.menu.bootloader.16kb.build.ldscript_path=linker_scripts/gcc/16KB_Bootloader
mzero.menu.bootloader.16kb.upload.maximum_size=245760
mzero.menu.bootloader.16kb.upload.tool=arduino:avrdude
mzero.menu.bootloader.16kb.upload.protocol=stk500v2
mzero.menu.bootloader.16kb.upload.speed=57600
mzero.menu.bootloader.16kb.build.emu.mcu=atmega2560
mzero.menu.bootloader.8kb=8KB_BOOTLOADER
mzero.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
mzero.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
mzero.menu.bootloader.8kb.upload.maximum_size=253952
mzero.menu.bootloader.8kb.upload.tool=MattairTech_Arduino:bossac
mzero.menu.bootloader.0kb=NO_BOOTLOADER
mzero.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
mzero.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
mzero.menu.bootloader.0kb.upload.tool=arduino:openocd
mzero.menu.bootloader.0kb.upload.use_1200bps_touch=false
mzero.menu.bootloader.0kb.upload.wait_for_upload_port=false
mzero.menu.bootloader.0kb.upload.native_usb=false
mzero.menu.bootloader.0kb.upload.maximum_size=262144
mzero.menu.serial.one_uart=ONE_UART_ONE_WIRE_ONE_SPI
mzero.menu.serial.one_uart.build.serialcom_uart=ONE_UART
mzero.menu.serial.one_uart.build.serialcom_wire=ONE_WIRE
mzero.menu.serial.one_uart.build.serialcom_spi=ONE_SPI
mzero.menu.serial.one_uart_two_wire_two_spi=ONE_UART_TWO_WIRE_TWO_SPI
mzero.menu.serial.one_uart_two_wire_two_spi.build.serialcom_uart=ONE_UART
mzero.menu.serial.one_uart_two_wire_two_spi.build.serialcom_wire=TWO_WIRE
mzero.menu.serial.one_uart_two_wire_two_spi.build.serialcom_spi=TWO_SPI
mzero.menu.serial.two_uart=TWO_UART_ONE_WIRE_ONE_SPI
mzero.menu.serial.two_uart.build.serialcom_uart=TWO_UART
mzero.menu.serial.two_uart.build.serialcom_wire=ONE_WIRE
mzero.menu.serial.two_uart.build.serialcom_spi=ONE_SPI
mzero.menu.serial.two_uart_two_wire_two_spi=TWO_UART_TWO_WIRE_TWO_SPI
mzero.menu.serial.two_uart_two_wire_two_spi.build.serialcom_uart=TWO_UART
mzero.menu.serial.two_uart_two_wire_two_spi.build.serialcom_wire=TWO_WIRE
mzero.menu.serial.two_uart_two_wire_two_spi.build.serialcom_spi=TWO_SPI
mzero.menu.serial.no_uart=NO_UART_ONE_WIRE_ONE_SPI
mzero.menu.serial.no_uart.build.serialcom_uart=NO_UART
mzero.menu.serial.no_uart.build.serialcom_wire=ONE_WIRE
mzero.menu.serial.no_uart.build.serialcom_spi=ONE_SPI
mzero.menu.serial.no_uart_two_wire_two_spi=NO_UART_TWO_WIRE_TWO_SPI
mzero.menu.serial.no_uart_two_wire_two_spi.build.serialcom_uart=NO_UART
mzero.menu.serial.no_uart_two_wire_two_spi.build.serialcom_wire=TWO_WIRE
mzero.menu.serial.no_uart_two_wire_two_spi.build.serialcom_spi=TWO_SPI
mzero.menu.usb.cdc=CDC_ONLY
mzero.menu.usb.cdc.build.usbcom=CDC_ONLY
mzero.menu.usb.cdc_hid=CDC_HID
mzero.menu.usb.cdc_hid.build.usbcom=CDC_HID
mzero.menu.usb.withcdc=WITH_CDC
mzero.menu.usb.withcdc.build.usbcom=WITH_CDC
mzero.menu.usb.hid=HID_ONLY
mzero.menu.usb.hid.build.usbcom=HID_ONLY
mzero.menu.usb.nocdc=WITHOUT_CDC
mzero.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
mzero.menu.usb.none=USB_DISABLED
mzero.menu.usb.none.build.usbcom=USB_DISABLED
